; ModuleID = 'closure.ca8bb9e2-cgu.0'
source_filename = "closure.ca8bb9e2-cgu.0"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%"core::fmt::Formatter" = type { { i64, i64 }, { i64, i64 }, { {}*, [3 x i64]* }, i32, i32, i8, [7 x i8] }
%"core::fmt::Opaque" = type {}
%"core::fmt::Arguments" = type { { [0 x { [0 x i8]*, i64 }]*, i64 }, { i64*, i64 }, { [0 x { i8*, i64* }]*, i64 } }
%"core::fmt::rt::v1::Argument" = type { i64, %"core::fmt::rt::v1::FormatSpec" }
%"core::fmt::rt::v1::FormatSpec" = type { { i64, i64 }, { i64, i64 }, i32, i32, i8, [7 x i8] }
%"core::fmt::UnsafeArg" = type { {} }
%"[closure@closure.rs:3:16: 5:3]" = type {}

@vtable.0 = private unnamed_addr constant <{ i8*, [16 x i8], i8*, i8*, i8*, [0 x i8] }> <{ i8* bitcast (void (i64**)* @"_ZN4core3ptr85drop_in_place$LT$std..rt..lang_start$LT$$LP$$RP$$GT$..$u7b$$u7b$closure$u7d$$u7d$$GT$17hf37cb0349477a582E" to i8*), [16 x i8] c"\08\00\00\00\00\00\00\00\08\00\00\00\00\00\00\00", i8* bitcast (i32 (i64**)* @"_ZN4core3ops8function6FnOnce40call_once$u7b$$u7b$vtable.shim$u7d$$u7d$17hf6aa763b5fa277b3E" to i8*), i8* bitcast (i32 (i64**)* @"_ZN3std2rt10lang_start28_$u7b$$u7b$closure$u7d$$u7d$17h75ff9ae243be978cE" to i8*), i8* bitcast (i32 (i64**)* @"_ZN3std2rt10lang_start28_$u7b$$u7b$closure$u7d$$u7d$17h75ff9ae243be978cE" to i8*), [0 x i8] zeroinitializer }>, align 8, !dbg !0

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "impl$<std::rt::lang_start::closure$0, core::ops::function::Fn<tuple$<> > >::vtable$", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, align: 64, elements: !6)
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ptr_const$<tuple$<> >", baseType: !5, size: 64, align: 64, dwarfAddressSpace: 0)
!5 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!6 = !{!7}
!7 = !DISubrange(count: 6, lowerBound: 0)
!8 = !{i32 7, !"PIC Level", i32 2}
!9 = !{i32 7, !"PIE Level", i32 2}
!10 = !{i32 2, !"CodeView", i32 1}
!11 = !{i32 2, !"Debug Info Version", i32 3}
!12 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !13, producer: "clang LLVM (rustc version 1.57.0 (f1edd0429 2021-11-29))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !14, globals: !93)
!13 = !DIFile(filename: "closure.rs", directory: "C:\\Users\\froze\\Desktop")
!14 = !{!15, !23, !32, !39, !41, !81}
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Result", scope: !16, file: !2, baseType: !18, size: 8, align: 8, flags: DIFlagEnumClass, elements: !20)
!16 = !DINamespace(name: "result", scope: !17)
!17 = !DINamespace(name: "core", scope: null)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !2, baseType: !19)
!19 = !DIBasicType(name: "unsigned __int8", size: 8, encoding: DW_ATE_unsigned)
!20 = !{!21, !22}
!21 = !DIEnumerator(name: "Ok", value: 0)
!22 = !DIEnumerator(name: "Err", value: 1)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !24, file: !2, baseType: !18, size: 8, align: 8, flags: DIFlagEnumClass, elements: !27)
!24 = !DINamespace(name: "v1", scope: !25)
!25 = !DINamespace(name: "rt", scope: !26)
!26 = !DINamespace(name: "fmt", scope: !17)
!27 = !{!28, !29, !30, !31}
!28 = !DIEnumerator(name: "Left", value: 0)
!29 = !DIEnumerator(name: "Right", value: 1)
!30 = !DIEnumerator(name: "Center", value: 2)
!31 = !DIEnumerator(name: "Unknown", value: 3)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Option", scope: !33, file: !2, baseType: !34, size: 64, align: 64, flags: DIFlagEnumClass, elements: !36)
!33 = !DINamespace(name: "option", scope: !17)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !2, baseType: !35)
!35 = !DIBasicType(name: "unsigned __int64", size: 64, encoding: DW_ATE_unsigned)
!36 = !{!37, !38}
!37 = !DIEnumerator(name: "None", value: 0)
!38 = !DIEnumerator(name: "Some", value: 1)
!39 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Option", scope: !33, file: !2, baseType: !40, size: 64, align: 64, flags: DIFlagEnumClass, elements: !36)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ptr_mut$<tuple$<> >", baseType: !5, size: 64, align: 64, dwarfAddressSpace: 0)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Discriminant$", scope: !42, file: !2, baseType: !55, size: 64, align: 64, flags: DIFlagEnumClass, elements: !91)
!42 = !DICompositeType(tag: DW_TAG_union_type, name: "enum$<core::option::Option<slice$<core::fmt::rt::v1::Argument> >, 1, 18446744073709551615, Some>", file: !2, size: 128, align: 64, elements: !43, templateParams: !88, identifier: "9f12058bb667a24b38934f7caa658ba4")
!43 = !{!44, !90}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "dataful_variant", scope: !42, file: !2, baseType: !45, size: 128, align: 64)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !42, file: !2, size: 128, align: 64, elements: !46, templateParams: !88, identifier: "9f12058bb667a24b38934f7caa658ba4::Some")
!46 = !{!47}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !45, file: !2, baseType: !48, size: 128, align: 64)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "slice$<core::fmt::rt::v1::Argument>", file: !2, size: 128, align: 64, elements: !49, templateParams: !73, identifier: "51a3f8d51de3c140666a7f399cafd84")
!49 = !{!50, !87}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !48, file: !2, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ptr_const$<Argument>", baseType: !52, size: 64, align: 64, dwarfAddressSpace: 0)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !24, file: !2, size: 448, align: 64, elements: !53, templateParams: !73, identifier: "5cedcac9814cbf911535f483b20c17c7")
!53 = !{!54, !57}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !52, file: !2, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "usize", file: !2, baseType: !56)
!56 = !DIBasicType(name: "size_t", size: 64, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !52, file: !2, baseType: !58, size: 384, align: 64, offset: 64)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !24, file: !2, size: 384, align: 64, elements: !59, templateParams: !73, identifier: "2fa51ffafee008ca951439ebb20b70cf")
!59 = !{!60, !62, !63, !66, !86}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !58, file: !2, baseType: !61, size: 32, align: 32, offset: 256)
!61 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_unsigned_char)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !58, file: !2, baseType: !23, size: 8, align: 8, offset: 320)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !58, file: !2, baseType: !64, size: 32, align: 32, offset: 288)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !2, baseType: !65)
!65 = !DIBasicType(name: "unsigned __int32", size: 32, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !58, file: !2, baseType: !67, size: 128, align: 64)
!67 = !DICompositeType(tag: DW_TAG_union_type, name: "enum$<core::fmt::rt::v1::Count>", file: !2, size: 128, align: 64, elements: !68, templateParams: !73, identifier: "ccce56050c87953c6357a40ad22ff917")
!68 = !{!69, !74, !78, !80}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "variant0", scope: !67, file: !2, baseType: !70, size: 128, align: 64, extraData: i64 0)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !67, file: !2, size: 128, align: 64, elements: !71, templateParams: !73, identifier: "ccce56050c87953c6357a40ad22ff917::Is")
!71 = !{!72}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !70, file: !2, baseType: !55, size: 64, align: 64, offset: 64)
!73 = !{}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "variant1", scope: !67, file: !2, baseType: !75, size: 128, align: 64, extraData: i64 1)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !67, file: !2, size: 128, align: 64, elements: !76, templateParams: !73, identifier: "ccce56050c87953c6357a40ad22ff917::Param")
!76 = !{!77}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !75, file: !2, baseType: !55, size: 64, align: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "variant2", scope: !67, file: !2, baseType: !79, size: 128, align: 64, extraData: i64 2)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !67, file: !2, size: 128, align: 64, elements: !73, templateParams: !73, identifier: "ccce56050c87953c6357a40ad22ff917::Implied")
!80 = !DIDerivedType(tag: DW_TAG_member, name: "discriminant", scope: !67, file: !2, baseType: !81, size: 64, align: 64)
!81 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Count", scope: !24, file: !2, baseType: !34, size: 64, align: 64, flags: DIFlagEnumClass, elements: !82)
!82 = !{!83, !84, !85}
!83 = !DIEnumerator(name: "Is", value: 0)
!84 = !DIEnumerator(name: "Param", value: 1)
!85 = !DIEnumerator(name: "Implied", value: 2)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !58, file: !2, baseType: !67, size: 128, align: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !48, file: !2, baseType: !55, size: 64, align: 64, offset: 64)
!88 = !{!89}
!89 = !DITemplateTypeParameter(name: "T", type: !48)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "discriminant", scope: !42, file: !2, baseType: !41, size: 128, align: 64)
!91 = !{!92}
!92 = !DIEnumerator(name: "None", value: 0, isUnsigned: true)
!93 = !{!0}
!94 = distinct !DISubprogram(name: "__rust_begin_short_backtrace<void (*)(),tuple$<> >", linkageName: "_ZN3std10sys_common9backtrace28__rust_begin_short_backtrace17h6fa59514f16be32cE", scope: !96, file: !95, line: 119, type: !99, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, templateParams: !108, retainedNodes: !104)
!95 = !DIFile(filename: "/rustc/f1edd0429582dd29cccacaf50fd134b05593bd9c\\library\\std\\src\\sys_common\\backtrace.rs", directory: "", checksumkind: CSK_SHA1, checksum: "7481dba50ead6f6229f49a1b24a1d4d6f773742a")
!96 = !DINamespace(name: "backtrace", scope: !97)
!97 = !DINamespace(name: "sys_common", scope: !98)
!98 = !DINamespace(name: "std", scope: null)
!99 = !DISubroutineType(types: !100)
!100 = !{null, !101}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void (*)()", baseType: !102, size: 64, align: 64, dwarfAddressSpace: 0)
!102 = !DISubroutineType(types: !103)
!103 = !{null}
!104 = !{!105, !106}
!105 = !DILocalVariable(name: "f", arg: 1, scope: !94, file: !95, line: 119, type: !101)
!106 = !DILocalVariable(name: "result", scope: !107, file: !95, line: 123, type: !5, align: 1)
!107 = distinct !DILexicalBlock(scope: !94, file: !95, line: 123)
!108 = !{!109, !110}
!109 = !DITemplateTypeParameter(name: "F", type: !101)
!110 = !DITemplateTypeParameter(name: "T", type: !5)
!111 = !DILocation(line: 123, scope: !107)
!112 = !DILocation(line: 119, scope: !94)
!113 = !DILocation(line: 123, scope: !94)
!114 = !DILocation(line: 126, scope: !107)
!115 = !DILocation(line: 129, scope: !94)
!116 = distinct !DISubprogram(name: "lang_start<tuple$<> >", linkageName: "_ZN3std2rt10lang_start17hd1622c0549b2dd5bE", scope: !118, file: !117, line: 140, type: !119, scopeLine: 140, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, templateParams: !131, retainedNodes: !125)
!117 = !DIFile(filename: "/rustc/f1edd0429582dd29cccacaf50fd134b05593bd9c\\library\\std\\src\\rt.rs", directory: "", checksumkind: CSK_SHA1, checksum: "597960a6bbe3770d8b00da46c70b0aa1a1e7a6d7")
!118 = !DINamespace(name: "rt", scope: !98)
!119 = !DISubroutineType(types: !120)
!120 = !{!121, !101, !121, !123}
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "isize", file: !2, baseType: !122)
!122 = !DIBasicType(name: "ptrdiff_t", size: 64, encoding: DW_ATE_signed)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ptr_const$<ptr_const$<u8> >", baseType: !124, size: 64, align: 64, dwarfAddressSpace: 0)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ptr_const$<u8>", baseType: !18, size: 64, align: 64, dwarfAddressSpace: 0)
!125 = !{!126, !127, !128, !129}
!126 = !DILocalVariable(name: "main", arg: 1, scope: !116, file: !117, line: 141, type: !101)
!127 = !DILocalVariable(name: "argc", arg: 2, scope: !116, file: !117, line: 142, type: !121)
!128 = !DILocalVariable(name: "argv", arg: 3, scope: !116, file: !117, line: 143, type: !123)
!129 = !DILocalVariable(name: "v", scope: !130, file: !117, line: 145, type: !121, align: 8)
!130 = distinct !DILexicalBlock(scope: !116, file: !117, line: 145)
!131 = !{!110}
!132 = !DILocation(line: 141, scope: !116)
!133 = !DILocation(line: 142, scope: !116)
!134 = !DILocation(line: 143, scope: !116)
!135 = !DILocation(line: 146, scope: !116)
!136 = !DILocation(line: 145, scope: !116)
!137 = !DILocation(line: 145, scope: !130)
!138 = !DILocation(line: 151, scope: !116)
!139 = distinct !DISubprogram(name: "closure$0<tuple$<> >", linkageName: "_ZN3std2rt10lang_start28_$u7b$$u7b$closure$u7d$$u7d$17h75ff9ae243be978cE", scope: !140, file: !117, line: 146, type: !141, scopeLine: 146, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, templateParams: !131, retainedNodes: !149)
!140 = !DINamespace(name: "lang_start", scope: !118)
!141 = !DISubroutineType(types: !142)
!142 = !{!143, !145}
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "i32", file: !2, baseType: !144)
!144 = !DIBasicType(name: "__int32", size: 32, encoding: DW_ATE_signed)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ref$<closure$0>", baseType: !146, size: 64, align: 64, dwarfAddressSpace: 0)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "closure$0", scope: !140, file: !2, size: 64, align: 64, elements: !147, templateParams: !73, identifier: "8e4da3de4eea775afcf16c7d920eb9d")
!147 = !{!148}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !146, file: !2, baseType: !101, size: 64, align: 64)
!149 = !{!150}
!150 = !DILocalVariable(name: "main", scope: !139, file: !117, line: 141, type: !101, align: 8)
!151 = !DILocation(line: 141, scope: !139)
!152 = !DILocation(line: 146, scope: !139)
!153 = distinct !DISubprogram(name: "as_i32", linkageName: "_ZN3std3sys7windows7process8ExitCode6as_i3217h61cac98f983069eeE", scope: !155, file: !154, line: 540, type: !161, scopeLine: 540, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, templateParams: !73, retainedNodes: !164)
!154 = !DIFile(filename: "/rustc/f1edd0429582dd29cccacaf50fd134b05593bd9c\\library\\std\\src\\sys\\windows\\process.rs", directory: "", checksumkind: CSK_SHA1, checksum: "f92da8c761b5c6d68870462ec738db5b47d28b46")
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !156, file: !2, size: 32, align: 32, elements: !159, templateParams: !73, identifier: "4883ccfa522087afb9ce066b3c14ebc5")
!156 = !DINamespace(name: "process", scope: !157)
!157 = !DINamespace(name: "windows", scope: !158)
!158 = !DINamespace(name: "sys", scope: !98)
!159 = !{!160}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !155, file: !2, baseType: !64, size: 32, align: 32)
!161 = !DISubroutineType(types: !162)
!162 = !{!143, !163}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ref$<ExitCode>", baseType: !155, size: 64, align: 64, dwarfAddressSpace: 0)
!164 = !{!165}
!165 = !DILocalVariable(name: "self", arg: 1, scope: !153, file: !154, line: 540, type: !163)
!166 = !DILocation(line: 540, scope: !153)
!167 = !DILocation(line: 541, scope: !153)
!168 = !DILocation(line: 542, scope: !153)
!169 = distinct !DISubprogram(name: "fmt<ref$<i32> >", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h80df41ad1fdab10fE", scope: !171, file: !170, line: 2092, type: !172, scopeLine: 2092, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, templateParams: !209, retainedNodes: !206)
!170 = !DIFile(filename: "/rustc/f1edd0429582dd29cccacaf50fd134b05593bd9c\\library\\core\\src\\fmt\\mod.rs", directory: "", checksumkind: CSK_SHA1, checksum: "93df5c1039ca8308be61b01d67bd09e339bcd850")
!171 = !DINamespace(name: "impl$52", scope: !26)
!172 = !DISubroutineType(types: !173)
!173 = !{!15, !174, !177}
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ref$<ref$<ref$<i32> > >", baseType: !175, size: 64, align: 64, dwarfAddressSpace: 0)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ref$<ref$<i32> >", baseType: !176, size: 64, align: 64, dwarfAddressSpace: 0)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ref$<i32>", baseType: !143, size: 64, align: 64, dwarfAddressSpace: 0)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ref_mut$<Formatter>", baseType: !178, size: 64, align: 64, dwarfAddressSpace: 0)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !26, file: !2, size: 512, align: 64, elements: !179, templateParams: !73, identifier: "fb98afdf1edc202faa2bef7389a2e91c")
!179 = !{!180, !181, !182, !183, !195, !196}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !178, file: !2, baseType: !64, size: 32, align: 32, offset: 384)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !178, file: !2, baseType: !61, size: 32, align: 32, offset: 416)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !178, file: !2, baseType: !23, size: 8, align: 8, offset: 448)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !178, file: !2, baseType: !184, size: 128, align: 64)
!184 = !DICompositeType(tag: DW_TAG_union_type, name: "enum$<core::option::Option<usize> >", file: !2, size: 128, align: 64, elements: !185, templateParams: !188, identifier: "f19787a163da56c09a842fffdb11add7")
!185 = !{!186, !190, !194}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "variant0", scope: !184, file: !2, baseType: !187, size: 128, align: 64, extraData: i64 0)
!187 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !184, file: !2, size: 128, align: 64, elements: !73, templateParams: !188, identifier: "f19787a163da56c09a842fffdb11add7::None")
!188 = !{!189}
!189 = !DITemplateTypeParameter(name: "T", type: !55)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "variant1", scope: !184, file: !2, baseType: !191, size: 128, align: 64, extraData: i64 1)
!191 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !184, file: !2, size: 128, align: 64, elements: !192, templateParams: !188, identifier: "f19787a163da56c09a842fffdb11add7::Some")
!192 = !{!193}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !191, file: !2, baseType: !55, size: 64, align: 64, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "discriminant", scope: !184, file: !2, baseType: !32, size: 64, align: 64)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !178, file: !2, baseType: !184, size: 128, align: 64, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !178, file: !2, baseType: !197, size: 128, align: 64, offset: 256)
!197 = !DICompositeType(tag: DW_TAG_structure_type, name: "ref_mut$<dyn$<core::fmt::Write> >", file: !2, size: 128, align: 64, elements: !198, templateParams: !73, identifier: "db21c4820ab588111e9b639306cc8f97")
!198 = !{!199, !201}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !197, file: !2, baseType: !200, size: 64, align: 64, flags: DIFlagArtificial)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ptr_mut$<u8>", baseType: !18, size: 64, align: 64, dwarfAddressSpace: 0)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !197, file: !2, baseType: !202, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ref$<array$<usize,3> >", baseType: !203, size: 64, align: 64, dwarfAddressSpace: 0)
!203 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 192, align: 64, elements: !204)
!204 = !{!205}
!205 = !DISubrange(count: 3, lowerBound: 0)
!206 = !{!207, !208}
!207 = !DILocalVariable(name: "self", arg: 1, scope: !169, file: !170, line: 2092, type: !174)
!208 = !DILocalVariable(name: "f", arg: 2, scope: !169, file: !170, line: 2092, type: !177)
!209 = !{!210}
!210 = !DITemplateTypeParameter(name: "T", type: !176)
!211 = !DILocation(line: 2092, scope: !169)
!212 = distinct !DISubprogram(name: "fmt<i32>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17hf11b6ad342e20347E", scope: !171, file: !170, line: 2092, type: !213, scopeLine: 2092, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, templateParams: !218, retainedNodes: !215)
!213 = !DISubroutineType(types: !214)
!214 = !{!15, !175, !177}
!215 = !{!216, !217}
!216 = !DILocalVariable(name: "self", arg: 1, scope: !212, file: !170, line: 2092, type: !175)
!217 = !DILocalVariable(name: "f", arg: 2, scope: !212, file: !170, line: 2092, type: !177)
!218 = !{!219}
!219 = !DITemplateTypeParameter(name: "T", type: !143)
!220 = !DILocation(line: 2092, scope: !212)
!221 = distinct !DISubprogram(name: "fmt<str>", linkageName: "_ZN44_$LT$$RF$T$u20$as$u20$core..fmt..Display$GT$3fmt17h5e64ad0dec4ba14aE", scope: !222, file: !170, line: 2092, type: !223, scopeLine: 2092, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, templateParams: !233, retainedNodes: !230)
!222 = !DINamespace(name: "impl$54", scope: !26)
!223 = !DISubroutineType(types: !224)
!224 = !{!15, !225, !177}
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ref$<str>", baseType: !226, size: 64, align: 64, dwarfAddressSpace: 0)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", file: !2, size: 128, align: 64, elements: !227, templateParams: !73, identifier: "7ef2a91eecc7bcf4b4aaea2dbce79437")
!227 = !{!228, !229}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !226, file: !2, baseType: !124, size: 64, align: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !226, file: !2, baseType: !55, size: 64, align: 64, offset: 64)
!230 = !{!231, !232}
!231 = !DILocalVariable(name: "self", arg: 1, scope: !221, file: !170, line: 2092, type: !225)
!232 = !DILocalVariable(name: "f", arg: 2, scope: !221, file: !170, line: 2092, type: !177)
!233 = !{!234}
!234 = !DITemplateTypeParameter(name: "T", type: !235)
!235 = !DICompositeType(tag: DW_TAG_array_type, baseType: !236, align: 8, elements: !238)
!236 = !DIDerivedType(tag: DW_TAG_typedef, name: "i8", file: !2, baseType: !237)
!237 = !DIBasicType(name: "__int8", size: 8, encoding: DW_ATE_signed)
!238 = !{!239}
!239 = !DISubrange(count: -1, lowerBound: 0)
!240 = !DILocation(line: 2092, scope: !221)
!241 = distinct !DISubprogram(name: "new<ref$<ref$<i32> > >", linkageName: "_ZN4core3fmt10ArgumentV13new17h069a113d46083fe4E", scope: !242, file: !170, line: 314, type: !251, scopeLine: 314, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, templateParams: !257, retainedNodes: !254)
!242 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !26, file: !2, size: 128, align: 64, elements: !243, templateParams: !73, identifier: "91360fa37a32cbf4b86ecc09678a3da8")
!243 = !{!244, !247}
!244 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !242, file: !2, baseType: !245, size: 64, align: 64)
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ref$<Opaque>", baseType: !246, size: 64, align: 64, dwarfAddressSpace: 0)
!246 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", file: !2, align: 8, elements: !73, identifier: "5dda6ffecdd070bdf504faeb28a11ae8")
!247 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !242, file: !2, baseType: !248, size: 64, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "enum$<core::result::Result<tuple$<>,core::fmt::Error> > (*)(ref$<core::fmt::::Opaque>,ref_mut$<core::fmt::Formatter>)", baseType: !249, size: 64, align: 64, dwarfAddressSpace: 0)
!249 = !DISubroutineType(types: !250)
!250 = !{!15, !245, !177}
!251 = !DISubroutineType(types: !252)
!252 = !{!242, !174, !253}
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "enum$<core::result::Result<tuple$<>,core::fmt::Error> > (*)(ref$<ref$<ref$<i32> > >,ref_mut$<core::fmt::Formatter>)", baseType: !172, size: 64, align: 64, dwarfAddressSpace: 0)
!254 = !{!255, !256}
!255 = !DILocalVariable(name: "x", arg: 1, scope: !241, file: !170, line: 314, type: !174)
!256 = !DILocalVariable(name: "f", arg: 2, scope: !241, file: !170, line: 314, type: !253)
!257 = !{!258}
!258 = !DITemplateTypeParameter(name: "T", type: !175)
!259 = !DILocation(line: 314, scope: !241)
!260 = !DILocation(line: 323, scope: !241)
!261 = !DILocation(line: 324, scope: !241)
!262 = distinct !DISubprogram(name: "new<str>", linkageName: "_ZN4core3fmt10ArgumentV13new17h862d5ae6304c41baE", scope: !242, file: !170, line: 314, type: !263, scopeLine: 314, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, templateParams: !269, retainedNodes: !266)
!263 = !DISubroutineType(types: !264)
!264 = !{!242, !225, !265}
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "enum$<core::result::Result<tuple$<>,core::fmt::Error> > (*)(ref$<str>,ref_mut$<core::fmt::Formatter>)", baseType: !223, size: 64, align: 64, dwarfAddressSpace: 0)
!266 = !{!267, !268}
!267 = !DILocalVariable(name: "x", arg: 1, scope: !262, file: !170, line: 314, type: !225)
!268 = !DILocalVariable(name: "f", arg: 2, scope: !262, file: !170, line: 314, type: !265)
!269 = !{!270}
!270 = !DITemplateTypeParameter(name: "T", type: !226)
!271 = !DILocation(line: 314, scope: !262)
!272 = !DILocation(line: 323, scope: !262)
!273 = !DILocation(line: 324, scope: !262)
!274 = distinct !DISubprogram(name: "new<u32>", linkageName: "_ZN4core3fmt10ArgumentV13new17hba11a38eda09b565E", scope: !242, file: !170, line: 314, type: !275, scopeLine: 314, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, templateParams: !284, retainedNodes: !281)
!275 = !DISubroutineType(types: !276)
!276 = !{!242, !277, !278}
!277 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ref$<u32>", baseType: !64, size: 64, align: 64, dwarfAddressSpace: 0)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "enum$<core::result::Result<tuple$<>,core::fmt::Error> > (*)(ref$<u32>,ref_mut$<core::fmt::Formatter>)", baseType: !279, size: 64, align: 64, dwarfAddressSpace: 0)
!279 = !DISubroutineType(types: !280)
!280 = !{!15, !277, !177}
!281 = !{!282, !283}
!282 = !DILocalVariable(name: "x", arg: 1, scope: !274, file: !170, line: 314, type: !277)
!283 = !DILocalVariable(name: "f", arg: 2, scope: !274, file: !170, line: 314, type: !278)
!284 = !{!285}
!285 = !DITemplateTypeParameter(name: "T", type: !64)
!286 = !DILocation(line: 314, scope: !274)
!287 = !DILocation(line: 323, scope: !274)
!288 = !DILocation(line: 324, scope: !274)
!289 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$i32$GT$3fmt17hd4b0ee6abcc0bbf4E", scope: !291, file: !290, line: 185, type: !293, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, templateParams: !73, retainedNodes: !295)
!290 = !DIFile(filename: "/rustc/f1edd0429582dd29cccacaf50fd134b05593bd9c\\library\\core\\src\\fmt\\num.rs", directory: "", checksumkind: CSK_SHA1, checksum: "dc43c0914ac0092af0ab175569929520a80e5ece")
!291 = !DINamespace(name: "impl$80", scope: !292)
!292 = !DINamespace(name: "num", scope: !26)
!293 = !DISubroutineType(types: !294)
!294 = !{!15, !176, !177}
!295 = !{!296, !297}
!296 = !DILocalVariable(name: "self", arg: 1, scope: !289, file: !290, line: 185, type: !176)
!297 = !DILocalVariable(name: "f", arg: 2, scope: !289, file: !290, line: 185, type: !177)
!298 = !DILocation(line: 185, scope: !289)
!299 = !DILocation(line: 186, scope: !289)
!300 = !DILocation(line: 188, scope: !289)
!301 = !DILocation(line: 187, scope: !289)
!302 = !DILocation(line: 193, scope: !289)
!303 = !{i8 0, i8 2}
!304 = !DILocation(line: 191, scope: !289)
!305 = !DILocation(line: 189, scope: !289)
!306 = distinct !DISubprogram(name: "new_v1_formatted", linkageName: "_ZN4core3fmt9Arguments16new_v1_formatted17h47c2401a08e57567E", scope: !307, file: !170, line: 382, type: !322, scopeLine: 382, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, templateParams: !73, retainedNodes: !327)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !26, file: !2, size: 384, align: 64, elements: !308, templateParams: !73, identifier: "7e38858026fda4b120e6e229c6a6a76e")
!308 = !{!309, !315, !316}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !307, file: !2, baseType: !310, size: 128, align: 64)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "slice$<str>", file: !2, size: 128, align: 64, elements: !311, templateParams: !73, identifier: "e5181a2ba73cefd2b9372dc5646453a9")
!311 = !{!312, !314}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !310, file: !2, baseType: !313, size: 64, align: 64)
!313 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ptr_const$<str>", baseType: !226, size: 64, align: 64, dwarfAddressSpace: 0)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !310, file: !2, baseType: !55, size: 64, align: 64, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !307, file: !2, baseType: !42, size: 128, align: 64, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !307, file: !2, baseType: !317, size: 128, align: 64, offset: 256)
!317 = !DICompositeType(tag: DW_TAG_structure_type, name: "slice$<core::fmt::ArgumentV1>", file: !2, size: 128, align: 64, elements: !318, templateParams: !73, identifier: "4ae4d5fabc328466c2dfc592dc22530c")
!318 = !{!319, !321}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !317, file: !2, baseType: !320, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ptr_const$<ArgumentV1>", baseType: !242, size: 64, align: 64, dwarfAddressSpace: 0)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !317, file: !2, baseType: !55, size: 64, align: 64, offset: 64)
!322 = !DISubroutineType(types: !323)
!323 = !{!307, !310, !317, !48, !324}
!324 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeArg", scope: !26, file: !2, align: 8, elements: !325, templateParams: !73, identifier: "a57c72f252b7955c360b03c29ff116b1")
!325 = !{!326}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !324, file: !2, baseType: !5, align: 8)
!327 = !{!328, !329, !330, !331}
!328 = !DILocalVariable(name: "pieces", scope: !306, file: !170, line: 383, type: !310, align: 8)
!329 = !DILocalVariable(name: "args", scope: !306, file: !170, line: 384, type: !317, align: 8)
!330 = !DILocalVariable(name: "fmt", scope: !306, file: !170, line: 385, type: !48, align: 8)
!331 = !DILocalVariable(name: "_unsafe_arg", arg: 4, scope: !306, file: !170, line: 386, type: !324)
!332 = !DILocation(line: 383, scope: !306)
!333 = !DILocation(line: 384, scope: !306)
!334 = !DILocation(line: 385, scope: !306)
!335 = !DILocation(line: 386, scope: !306)
!336 = !DILocation(line: 388, scope: !306)
!337 = !DILocation(line: 389, scope: !306)
!338 = distinct !DISubprogram(name: "call_once<std::rt::lang_start::closure$0,tuple$<> >", linkageName: "_ZN4core3ops8function6FnOnce40call_once$u7b$$u7b$vtable.shim$u7d$$u7d$17hf6aa763b5fa277b3E", scope: !340, file: !339, line: 227, type: !343, scopeLine: 227, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, templateParams: !349, retainedNodes: !346)
!339 = !DIFile(filename: "/rustc/f1edd0429582dd29cccacaf50fd134b05593bd9c\\library\\core\\src\\ops\\function.rs", directory: "", checksumkind: CSK_SHA1, checksum: "9bea7362fff50bbe301170918847d3ca3912a24a")
!340 = !DINamespace(name: "FnOnce", scope: !341)
!341 = !DINamespace(name: "function", scope: !342)
!342 = !DINamespace(name: "ops", scope: !17)
!343 = !DISubroutineType(types: !344)
!344 = !{!143, !345}
!345 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ptr_mut$<closure$0>", baseType: !146, size: 64, align: 64, dwarfAddressSpace: 0)
!346 = !{!347, !348}
!347 = !DILocalVariable(arg: 1, scope: !338, file: !339, line: 227, type: !345)
!348 = !DILocalVariable(arg: 2, scope: !338, file: !339, line: 227, type: !5)
!349 = !{!350, !351}
!350 = !DITemplateTypeParameter(name: "Self", type: !146)
!351 = !DITemplateTypeParameter(name: "Args", type: !5)
!352 = !DILocation(line: 227, scope: !338)
!353 = distinct !DISubprogram(name: "call_once<std::rt::lang_start::closure$0,tuple$<> >", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h2681164c28724320E", scope: !340, file: !339, line: 227, type: !354, scopeLine: 227, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, templateParams: !349, retainedNodes: !356)
!354 = !DISubroutineType(types: !355)
!355 = !{!143, !146}
!356 = !{!357, !358}
!357 = !DILocalVariable(arg: 1, scope: !353, file: !339, line: 227, type: !146)
!358 = !DILocalVariable(arg: 2, scope: !353, file: !339, line: 227, type: !5)
!359 = !DILocation(line: 227, scope: !353)
!360 = distinct !DISubprogram(name: "call_once<void (*)(),tuple$<> >", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h5248f5019cad8882E", scope: !340, file: !339, line: 227, type: !99, scopeLine: 227, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, templateParams: !364, retainedNodes: !361)
!361 = !{!362, !363}
!362 = !DILocalVariable(arg: 1, scope: !360, file: !339, line: 227, type: !101)
!363 = !DILocalVariable(arg: 2, scope: !360, file: !339, line: 227, type: !5)
!364 = !{!365, !351}
!365 = !DITemplateTypeParameter(name: "Self", type: !101)
!366 = !DILocation(line: 227, scope: !360)
