; ModuleID = 'dr.510174b9-cgu.0'
source_filename = "dr.510174b9-cgu.0"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%"core::result::Result<std::thread::JoinHandle<()>, std::io::error::Error>" = type { i64, [4 x i64] }
%"std::io::error::Error" = type { %"std::io::error::Repr" }
%"std::io::error::Repr" = type { i8, [15 x i8] }
%"core::result::Result<core::convert::Infallible, std::io::error::Error>::Err" = type { %"std::io::error::Error" }
%"core::result::Result<std::thread::JoinHandle<()>, std::io::error::Error>::Err" = type { [1 x i64], %"std::io::error::Error" }
%"core::alloc::AllocError" = type {}
%"core::result::Result<core::convert::Infallible, core::alloc::AllocError>::Err" = type { %"core::alloc::AllocError" }
%"core::result::Result<core::ptr::non_null::NonNull<[u8]>, core::alloc::AllocError>::Err" = type { %"core::alloc::AllocError" }
%"core::result::Result<std::ffi::c_str::CString, std::ffi::c_str::NulError>" = type { i64, [4 x i64] }
%"alloc::string::String" = type { %"alloc::vec::Vec<u8>" }
%"alloc::vec::Vec<u8>" = type { { i8*, i64 }, i64 }
%"std::thread::JoinInner<()>" = type { { i64, i8* }, i64*, i64* }
%"core::cell::UnsafeCell<core::option::Option<core::result::Result<(), alloc::boxed::Box<dyn core::any::Any + core::marker::Send>>>>" = type { %"core::option::Option<core::result::Result<(), alloc::boxed::Box<dyn core::any::Any + core::marker::Send>>>" }

!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, align: 64, elements: !6)
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ptr_const$<tuple$<> >", baseType: !5, size: 64, align: 64, dwarfAddressSpace: 0)
!5 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!6 = !{!7}
!7 = !DISubrange(count: 6, lowerBound: 0)
!8 = !DIGlobalVariableExpression(var: !9, expr: !DIExpression())
!9 = distinct !DIGlobalVariable(name: "impl$<std::thread::impl$0::spawn_unchecked::closure$1, core::ops::function::FnOnce<tuple$<> > >::vtable$", scope: null, file: !2, type: !10, isLocal: true, isDefinition: true)
!10 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 256, align: 64, elements: !11)
!11 = !{!12}
!12 = !DISubrange(count: 4, lowerBound: 0)
!13 = !DIGlobalVariableExpression(var: !14, expr: !DIExpression())
!14 = distinct !DIGlobalVariable(name: "impl$<std::thread::impl$0::spawn_unchecked::closure$1, core::ops::function::FnOnce<tuple$<> > >::vtable$", scope: null, file: !2, type: !10, isLocal: true, isDefinition: true)
!15 = !DIGlobalVariableExpression(var: !16, expr: !DIExpression())
!16 = distinct !DIGlobalVariable(name: "impl$<std::ffi::c_str::NulError, core::fmt::Debug>::vtable$", scope: null, file: !2, type: !10, isLocal: true, isDefinition: true)
!17 = !DIGlobalVariableExpression(var: !18, expr: !DIExpression())
!18 = distinct !DIGlobalVariable(name: "impl$<std::io::error::Error, core::fmt::Debug>::vtable$", scope: null, file: !2, type: !10, isLocal: true, isDefinition: true)
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "impl$<alloc::boxed::Box<dyn$<core::any::Any,core::marker::Send>,alloc::alloc::Global>, core::fmt::Debug>::vtable$", scope: null, file: !2, type: !10, isLocal: true, isDefinition: true)
!21 = !{i32 7, !"PIC Level", i32 2}
!22 = !{i32 7, !"PIE Level", i32 2}
!23 = !{i32 2, !"CodeView", i32 1}
!24 = !{i32 2, !"Debug Info Version", i32 3}
!25 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !26, producer: "clang LLVM (rustc version 1.57.0 (f1edd0429 2021-11-29))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !27, globals: !463)
!26 = !DIFile(filename: "dr.rs", directory: "C:\\Users\\froze\\Desktop\\cpg-thread-context")
!27 = !{!28, !36, !41, !48, !50, !85, !86, !115, !123, !166, !191, !226, !309, !310, !319, !356, !366, !379, !386, !395, !410, !434, !440, !462}
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Result", scope: !29, file: !2, baseType: !31, size: 64, align: 64, flags: DIFlagEnumClass, elements: !33)
!29 = !DINamespace(name: "result", scope: !30)
!30 = !DINamespace(name: "core", scope: null)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !2, baseType: !32)
!32 = !DIBasicType(name: "unsigned __int64", size: 64, encoding: DW_ATE_unsigned)
!33 = !{!34, !35}
!34 = !DIEnumerator(name: "Ok", value: 0)
!35 = !DIEnumerator(name: "Err", value: 1)
!36 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Option", scope: !37, file: !2, baseType: !31, size: 64, align: 64, flags: DIFlagEnumClass, elements: !38)
!37 = !DINamespace(name: "option", scope: !30)
!38 = !{!39, !40}
!39 = !DIEnumerator(name: "None", value: 0)
!40 = !DIEnumerator(name: "Some", value: 1)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_void", scope: !42, file: !2, baseType: !43, size: 8, align: 8, flags: DIFlagEnumClass, elements: !45)
!42 = !DINamespace(name: "ffi", scope: !30)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !2, baseType: !44)
!44 = !DIBasicType(name: "unsigned __int8", size: 8, encoding: DW_ATE_unsigned)
!45 = !{!46, !47}
!46 = !DIEnumerator(name: "__variant1", value: 0, isUnsigned: true)
!47 = !DIEnumerator(name: "__variant2", value: 1, isUnsigned: true)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Option", scope: !37, file: !2, baseType: !49, size: 64, align: 64, flags: DIFlagEnumClass, elements: !38)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ptr_mut$<tuple$<> >", baseType: !5, size: 64, align: 64, dwarfAddressSpace: 0)
!50 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Discriminant$", scope: !51, file: !2, baseType: !68, size: 64, align: 64, flags: DIFlagEnumClass, elements: !83)
!51 = !DICompositeType(tag: DW_TAG_union_type, name: "enum$<core::option::Option<std::ffi::c_str::CString>, 1, 18446744073709551615, Some>", file: !2, size: 128, align: 64, elements: !52, templateParams: !80, identifier: "754259ae908e0dff6f479030bc01cf54")
!52 = !{!53, !82}
!53 = !DIDerivedType(tag: DW_TAG_member, name: "dataful_variant", scope: !51, file: !2, baseType: !54, size: 128, align: 64)
!54 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !51, file: !2, size: 128, align: 64, elements: !55, templateParams: !80, identifier: "754259ae908e0dff6f479030bc01cf54::Some")
!55 = !{!56}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !54, file: !2, baseType: !57, size: 128, align: 64)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "CString", scope: !58, file: !2, size: 128, align: 64, elements: !61, templateParams: !79, identifier: "9688d38afa4b73ac9740ae8b75d69744")
!58 = !DINamespace(name: "c_str", scope: !59)
!59 = !DINamespace(name: "ffi", scope: !60)
!60 = !DINamespace(name: "std", scope: null)
!61 = !{!62}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !57, file: !2, baseType: !63, size: 128, align: 64)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<slice$<u8>,alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !64, templateParams: !70, identifier: "781dc4a0f8d31b8fb608391f5a32a934")
!64 = !{!65, !67}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !63, file: !2, baseType: !66, size: 64, align: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ptr_const$<u8>", baseType: !43, size: 64, align: 64, dwarfAddressSpace: 0)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !63, file: !2, baseType: !68, size: 64, align: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "usize", file: !2, baseType: !69)
!69 = !DIBasicType(name: "size_t", size: 64, encoding: DW_ATE_unsigned)
!70 = !{!71, !75}
!71 = !DITemplateTypeParameter(name: "T", type: !72)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, align: 8, elements: !73)
!73 = !{!74}
!74 = !DISubrange(count: -1, lowerBound: 0)
!75 = !DITemplateTypeParameter(name: "A", type: !76)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !77, file: !2, align: 8, elements: !79, templateParams: !79, identifier: "ccfdb4312b1989d4e194b4f77c30bdce")
!77 = !DINamespace(name: "alloc", scope: !78)
!78 = !DINamespace(name: "alloc", scope: null)
!79 = !{}
!80 = !{!81}
!81 = !DITemplateTypeParameter(name: "T", type: !57)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "discriminant", scope: !51, file: !2, baseType: !50, size: 128, align: 64)
!83 = !{!84}
!84 = !DIEnumerator(name: "None", value: 0, isUnsigned: true)
!85 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Result", scope: !29, file: !2, baseType: !49, size: 64, align: 64, flags: DIFlagEnumClass, elements: !33)
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Discriminant$", scope: !87, file: !2, baseType: !68, size: 64, align: 64, flags: DIFlagEnumClass, elements: !113)
!87 = !DICompositeType(tag: DW_TAG_union_type, name: "enum$<core::result::Result<tuple$<>,alloc::boxed::Box<dyn$<core::any::Any,core::marker::Send>,alloc::alloc::Global> >, 1, 18446744073709551615, Err>", file: !2, size: 128, align: 64, elements: !88, templateParams: !109, identifier: "1001f17f753e0ed6cba7f90f2c2e152f")
!88 = !{!89, !112}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "dataful_variant", scope: !87, file: !2, baseType: !90, size: 128, align: 64)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !87, file: !2, size: 128, align: 64, elements: !91, templateParams: !109, identifier: "1001f17f753e0ed6cba7f90f2c2e152f::Err")
!91 = !{!92}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !90, file: !2, baseType: !93, size: 128, align: 64)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "Box<dyn$<core::any::Any,core::marker::Send>,alloc::alloc::Global>", scope: !94, file: !2, size: 128, align: 64, elements: !95, templateParams: !103, identifier: "e9858223fb63a45cb157ea1c9f792a88")
!94 = !DINamespace(name: "boxed", scope: !78)
!95 = !{!96, !98}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !93, file: !2, baseType: !97, size: 64, align: 64, flags: DIFlagArtificial)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ptr_mut$<u8>", baseType: !43, size: 64, align: 64, dwarfAddressSpace: 0)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !93, file: !2, baseType: !99, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ref$<array$<usize,3> >", baseType: !100, size: 64, align: 64, dwarfAddressSpace: 0)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 192, align: 64, elements: !101)
!101 = !{!102}
!102 = !DISubrange(count: 3, lowerBound: 0)
!103 = !{!104, !75}
!104 = !DITemplateTypeParameter(name: "T", type: !105)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn$<core::any::Any,core::marker::Send>", file: !2, align: 8, elements: !106, templateParams: !79, identifier: "eeacefc368d91e6532a1d444cb80b967")
!106 = !{!107, !108}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !105, file: !2, baseType: !97, size: 64, align: 64, flags: DIFlagArtificial)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !105, file: !2, baseType: !99, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!109 = !{!110, !111}
!110 = !DITemplateTypeParameter(name: "T", type: !5)
!111 = !DITemplateTypeParameter(name: "E", type: !93)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "discriminant", scope: !87, file: !2, baseType: !86, size: 128, align: 64)
!113 = !{!114}
!114 = !DIEnumerator(name: "Ok", value: 0, isUnsigned: true)
!115 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Repr", scope: !116, file: !2, baseType: !43, size: 8, align: 8, flags: DIFlagEnumClass, elements: !118)
!116 = !DINamespace(name: "error", scope: !117)
!117 = !DINamespace(name: "io", scope: !60)
!118 = !{!119, !120, !121, !122}
!119 = !DIEnumerator(name: "Os", value: 0)
!120 = !DIEnumerator(name: "Simple", value: 1)
!121 = !DIEnumerator(name: "SimpleMessage", value: 2)
!122 = !DIEnumerator(name: "Custom", value: 3)
!123 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ErrorKind", scope: !116, file: !2, baseType: !43, size: 8, align: 8, flags: DIFlagEnumClass, elements: !124)
!124 = !{!125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165}
!125 = !DIEnumerator(name: "NotFound", value: 0)
!126 = !DIEnumerator(name: "PermissionDenied", value: 1)
!127 = !DIEnumerator(name: "ConnectionRefused", value: 2)
!128 = !DIEnumerator(name: "ConnectionReset", value: 3)
!129 = !DIEnumerator(name: "HostUnreachable", value: 4)
!130 = !DIEnumerator(name: "NetworkUnreachable", value: 5)
!131 = !DIEnumerator(name: "ConnectionAborted", value: 6)
!132 = !DIEnumerator(name: "NotConnected", value: 7)
!133 = !DIEnumerator(name: "AddrInUse", value: 8)
!134 = !DIEnumerator(name: "AddrNotAvailable", value: 9)
!135 = !DIEnumerator(name: "NetworkDown", value: 10)
!136 = !DIEnumerator(name: "BrokenPipe", value: 11)
!137 = !DIEnumerator(name: "AlreadyExists", value: 12)
!138 = !DIEnumerator(name: "WouldBlock", value: 13)
!139 = !DIEnumerator(name: "NotADirectory", value: 14)
!140 = !DIEnumerator(name: "IsADirectory", value: 15)
!141 = !DIEnumerator(name: "DirectoryNotEmpty", value: 16)
!142 = !DIEnumerator(name: "ReadOnlyFilesystem", value: 17)
!143 = !DIEnumerator(name: "FilesystemLoop", value: 18)
!144 = !DIEnumerator(name: "StaleNetworkFileHandle", value: 19)
!145 = !DIEnumerator(name: "InvalidInput", value: 20)
!146 = !DIEnumerator(name: "InvalidData", value: 21)
!147 = !DIEnumerator(name: "TimedOut", value: 22)
!148 = !DIEnumerator(name: "WriteZero", value: 23)
!149 = !DIEnumerator(name: "StorageFull", value: 24)
!150 = !DIEnumerator(name: "NotSeekable", value: 25)
!151 = !DIEnumerator(name: "FilesystemQuotaExceeded", value: 26)
!152 = !DIEnumerator(name: "FileTooLarge", value: 27)
!153 = !DIEnumerator(name: "ResourceBusy", value: 28)
!154 = !DIEnumerator(name: "ExecutableFileBusy", value: 29)
!155 = !DIEnumerator(name: "Deadlock", value: 30)
!156 = !DIEnumerator(name: "CrossesDevices", value: 31)
!157 = !DIEnumerator(name: "TooManyLinks", value: 32)
!158 = !DIEnumerator(name: "FilenameTooLong", value: 33)
!159 = !DIEnumerator(name: "ArgumentListTooLong", value: 34)
!160 = !DIEnumerator(name: "Interrupted", value: 35)
!161 = !DIEnumerator(name: "Unsupported", value: 36)
!162 = !DIEnumerator(name: "UnexpectedEof", value: 37)
!163 = !DIEnumerator(name: "OutOfMemory", value: 38)
!164 = !DIEnumerator(name: "Other", value: 39)
!165 = !DIEnumerator(name: "Uncategorized", value: 40)
!166 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Discriminant$", scope: !167, file: !2, baseType: !68, size: 64, align: 64, flags: DIFlagEnumClass, elements: !189)
!167 = !DICompositeType(tag: DW_TAG_union_type, name: "enum$<core::result::Result<core::ptr::non_null::NonNull<slice$<u8> >,core::alloc::AllocError>, 1, 18446744073709551615, Ok>", file: !2, size: 128, align: 64, elements: !168, templateParams: !183, identifier: "f43117e4b9e1f6ce574e4ece51a41738")
!168 = !{!169, !188}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "dataful_variant", scope: !167, file: !2, baseType: !170, size: 128, align: 64)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !167, file: !2, size: 128, align: 64, elements: !171, templateParams: !183, identifier: "f43117e4b9e1f6ce574e4ece51a41738::Ok")
!171 = !{!172}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !170, file: !2, baseType: !173, size: 128, align: 64)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<slice$<u8> >", scope: !174, file: !2, size: 128, align: 64, elements: !176, templateParams: !182, identifier: "ef45889d32cc8ad2e949c035e7e671fe")
!174 = !DINamespace(name: "non_null", scope: !175)
!175 = !DINamespace(name: "ptr", scope: !30)
!176 = !{!177}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !173, file: !2, baseType: !178, size: 128, align: 64)
!178 = !DICompositeType(tag: DW_TAG_structure_type, name: "ptr_const$<slice$<u8> >", file: !2, size: 128, align: 64, elements: !179, templateParams: !79, identifier: "f5bc56280f62752aca6114f169d6965e")
!179 = !{!180, !181}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !178, file: !2, baseType: !66, size: 64, align: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !178, file: !2, baseType: !68, size: 64, align: 64, offset: 64)
!182 = !{!71}
!183 = !{!184, !185}
!184 = !DITemplateTypeParameter(name: "T", type: !173)
!185 = !DITemplateTypeParameter(name: "E", type: !186)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "AllocError", scope: !187, file: !2, align: 8, elements: !79, templateParams: !79, identifier: "4e76bfd0f9a8f01dca6ebfc0050d2f52")
!187 = !DINamespace(name: "alloc", scope: !30)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "discriminant", scope: !167, file: !2, baseType: !166, size: 128, align: 64)
!189 = !{!190}
!190 = !DIEnumerator(name: "Err", value: 0, isUnsigned: true)
!191 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Discriminant$", scope: !192, file: !2, baseType: !68, size: 64, align: 64, flags: DIFlagEnumClass, elements: !83)
!192 = !DICompositeType(tag: DW_TAG_union_type, name: "enum$<core::option::Option<alloc::string::String>, 1, 18446744073709551615, Some>", file: !2, size: 192, align: 64, elements: !193, templateParams: !223, identifier: "87fcd54aa01830adf8693565b5570f47")
!193 = !{!194, !225}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "dataful_variant", scope: !192, file: !2, baseType: !195, size: 192, align: 64)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !192, file: !2, size: 192, align: 64, elements: !196, templateParams: !223, identifier: "87fcd54aa01830adf8693565b5570f47::Some")
!196 = !{!197}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !195, file: !2, baseType: !198, size: 192, align: 64)
!198 = !DICompositeType(tag: DW_TAG_structure_type, name: "String", scope: !199, file: !2, size: 192, align: 64, elements: !200, templateParams: !79, identifier: "e31f06f6c478216b42a48dc0e6a169c")
!199 = !DINamespace(name: "string", scope: !78)
!200 = !{!201}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !198, file: !2, baseType: !202, size: 192, align: 64)
!202 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<u8,alloc::alloc::Global>", scope: !203, file: !2, size: 192, align: 64, elements: !204, templateParams: !221, identifier: "bc42cb22a991034fa9293b51a772056")
!203 = !DINamespace(name: "vec", scope: !78)
!204 = !{!205, !222}
!205 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !202, file: !2, baseType: !206, size: 128, align: 64)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<u8,alloc::alloc::Global>", scope: !207, file: !2, size: 128, align: 64, elements: !208, templateParams: !221, identifier: "6a0ae18552930ae731a364af5fcf9e8e")
!207 = !DINamespace(name: "raw_vec", scope: !78)
!208 = !{!209, !219, !220}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !206, file: !2, baseType: !210, size: 64, align: 64)
!210 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<u8>", scope: !211, file: !2, size: 64, align: 64, elements: !212, templateParams: !217, identifier: "2cb8ec6240124cc04ffd1990d41f3718")
!211 = !DINamespace(name: "unique", scope: !175)
!212 = !{!213, !214}
!213 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !210, file: !2, baseType: !66, size: 64, align: 64)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !210, file: !2, baseType: !215, align: 8)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8>", scope: !216, file: !2, align: 8, elements: !79, templateParams: !217, identifier: "c50e45f4768616516cd2885a0fdefcc")
!216 = !DINamespace(name: "marker", scope: !30)
!217 = !{!218}
!218 = !DITemplateTypeParameter(name: "T", type: !43)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !206, file: !2, baseType: !68, size: 64, align: 64, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !206, file: !2, baseType: !76, align: 8)
!221 = !{!218, !75}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !202, file: !2, baseType: !68, size: 64, align: 64, offset: 128)
!223 = !{!224}
!224 = !DITemplateTypeParameter(name: "T", type: !198)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "discriminant", scope: !192, file: !2, baseType: !191, size: 192, align: 64)
!226 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Discriminant$", scope: !227, file: !2, baseType: !68, size: 64, align: 64, flags: DIFlagEnumClass, elements: !83)
!227 = !DICompositeType(tag: DW_TAG_union_type, name: "enum$<core::option::Option<alloc::sync::Arc<std::sync::mutex::Mutex<alloc::vec::Vec<u8,alloc::alloc::Global> > > >, 1, 18446744073709551615, Some>", file: !2, size: 64, align: 64, elements: !228, templateParams: !306, identifier: "8ab8c4df39837df582c905fa889bdc98")
!228 = !{!229, !308}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "dataful_variant", scope: !227, file: !2, baseType: !230, size: 64, align: 64)
!230 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !227, file: !2, size: 64, align: 64, elements: !231, templateParams: !306, identifier: "8ab8c4df39837df582c905fa889bdc98::Some")
!231 = !{!232}
!232 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !230, file: !2, baseType: !233, size: 64, align: 64)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::sync::mutex::Mutex<alloc::vec::Vec<u8,alloc::alloc::Global> > >", scope: !234, file: !2, size: 64, align: 64, elements: !235, templateParams: !300, identifier: "74c07bd9105e90721d160357c04015e0")
!234 = !DINamespace(name: "sync", scope: !78)
!235 = !{!236, !304}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !233, file: !2, baseType: !237, size: 64, align: 64)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::sync::mutex::Mutex<alloc::vec::Vec<u8,alloc::alloc::Global> > > >", scope: !174, file: !2, size: 64, align: 64, elements: !238, templateParams: !302, identifier: "fcb2d9be2d3fb6079d7ef27857bc9059")
!238 = !{!239}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !237, file: !2, baseType: !240, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ptr_const$<ArcInner<std::sync::mutex::Mutex<alloc::vec::Vec<u8,alloc::alloc::Global> > > >", baseType: !241, size: 64, align: 64, dwarfAddressSpace: 0)
!241 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::sync::mutex::Mutex<alloc::vec::Vec<u8,alloc::alloc::Global> > >", scope: !234, file: !2, size: 448, align: 64, elements: !242, templateParams: !300, identifier: "b48d63eab734061cc4f392b04b39acdc")
!242 = !{!243, !255, !256}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !241, file: !2, baseType: !244, size: 64, align: 64)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !245, file: !2, size: 64, align: 64, elements: !247, templateParams: !79, identifier: "bc2660cf2a859728fe67b6c1220042c7")
!245 = !DINamespace(name: "atomic", scope: !246)
!246 = !DINamespace(name: "sync", scope: !30)
!247 = !{!248}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !244, file: !2, baseType: !249, size: 64, align: 64)
!249 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !250, file: !2, size: 64, align: 64, elements: !251, templateParams: !253, identifier: "f67915899c4d069386802aac361a007")
!250 = !DINamespace(name: "cell", scope: !30)
!251 = !{!252}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !249, file: !2, baseType: !68, size: 64, align: 64)
!253 = !{!254}
!254 = !DITemplateTypeParameter(name: "T", type: !68)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !241, file: !2, baseType: !244, size: 64, align: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !241, file: !2, baseType: !257, size: 320, align: 64, offset: 128)
!257 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<alloc::vec::Vec<u8,alloc::alloc::Global> >", scope: !258, file: !2, size: 320, align: 64, elements: !260, templateParams: !298, identifier: "562785f3a11646d5f7a857b6e510c69b")
!258 = !DINamespace(name: "mutex", scope: !259)
!259 = !DINamespace(name: "sync", scope: !60)
!260 = !{!261, !283, !294}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !257, file: !2, baseType: !262, size: 64, align: 64)
!262 = !DICompositeType(tag: DW_TAG_structure_type, name: "MovableMutex", scope: !263, file: !2, size: 64, align: 64, elements: !265, templateParams: !79, identifier: "b9a934c439c3536c56c35611b3292281")
!263 = !DINamespace(name: "mutex", scope: !264)
!264 = !DINamespace(name: "sys_common", scope: !60)
!265 = !{!266}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !262, file: !2, baseType: !267, size: 64, align: 64)
!267 = !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex", scope: !268, file: !2, size: 64, align: 64, elements: !271, templateParams: !79, identifier: "4862f7549228d857ef5a31f26a3c50")
!268 = !DINamespace(name: "mutex", scope: !269)
!269 = !DINamespace(name: "windows", scope: !270)
!270 = !DINamespace(name: "sys", scope: !60)
!271 = !{!272}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "srwlock", scope: !267, file: !2, baseType: !273, size: 64, align: 64)
!273 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<std::sys::windows::c::SRWLOCK>", scope: !250, file: !2, size: 64, align: 64, elements: !274, templateParams: !281, identifier: "d037f5f9c347bd33e0350419d45ad539")
!274 = !{!275}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !273, file: !2, baseType: !276, size: 64, align: 64)
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "SRWLOCK", scope: !277, file: !2, size: 64, align: 64, elements: !278, templateParams: !79, identifier: "70c1a5bba8b5d67b72c288eb6e04203")
!277 = !DINamespace(name: "c", scope: !269)
!278 = !{!279}
!279 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !276, file: !2, baseType: !280, size: 64, align: 64)
!280 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ptr_mut$<enum$<core::ffi::c_void> >", baseType: !41, size: 64, align: 64, dwarfAddressSpace: 0)
!281 = !{!282}
!282 = !DITemplateTypeParameter(name: "T", type: !276)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "poison", scope: !257, file: !2, baseType: !284, size: 8, align: 8, offset: 64)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "Flag", scope: !285, file: !2, size: 8, align: 8, elements: !286, templateParams: !79, identifier: "5f7b95f64b632ef17db8ea1cf9b2c6a8")
!285 = !DINamespace(name: "poison", scope: !259)
!286 = !{!287}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "failed", scope: !284, file: !2, baseType: !288, size: 8, align: 8)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicBool", scope: !245, file: !2, size: 8, align: 8, elements: !289, templateParams: !79, identifier: "8326a20fd8905df643eb5e0fd7de99d4")
!289 = !{!290}
!290 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !288, file: !2, baseType: !291, size: 8, align: 8)
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u8>", scope: !250, file: !2, size: 8, align: 8, elements: !292, templateParams: !217, identifier: "d55054769063d2534c2d2fd25b480e43")
!292 = !{!293}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !291, file: !2, baseType: !43, size: 8, align: 8)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !257, file: !2, baseType: !295, size: 192, align: 64, offset: 128)
!295 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<alloc::vec::Vec<u8,alloc::alloc::Global> >", scope: !250, file: !2, size: 192, align: 64, elements: !296, templateParams: !298, identifier: "95e01d42bedca0a5519765c2cea4480e")
!296 = !{!297}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !295, file: !2, baseType: !202, size: 192, align: 64)
!298 = !{!299}
!299 = !DITemplateTypeParameter(name: "T", type: !202)
!300 = !{!301}
!301 = !DITemplateTypeParameter(name: "T", type: !257)
!302 = !{!303}
!303 = !DITemplateTypeParameter(name: "T", type: !241)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !233, file: !2, baseType: !305, align: 8)
!305 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::sync::mutex::Mutex<alloc::vec::Vec<u8,alloc::alloc::Global> > > >", scope: !216, file: !2, align: 8, elements: !79, templateParams: !302, identifier: "490c4375d2a94fbe4c69a492701ba662")
!306 = !{!307}
!307 = !DITemplateTypeParameter(name: "T", type: !233)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "discriminant", scope: !227, file: !2, baseType: !226, size: 64, align: 64)
!309 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Result", scope: !29, file: !2, baseType: !43, size: 8, align: 8, flags: DIFlagEnumClass, elements: !33)
!310 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !311, file: !2, baseType: !43, size: 8, align: 8, flags: DIFlagEnumClass, elements: !314)
!311 = !DINamespace(name: "v1", scope: !312)
!312 = !DINamespace(name: "rt", scope: !313)
!313 = !DINamespace(name: "fmt", scope: !30)
!314 = !{!315, !316, !317, !318}
!315 = !DIEnumerator(name: "Left", value: 0)
!316 = !DIEnumerator(name: "Right", value: 1)
!317 = !DIEnumerator(name: "Center", value: 2)
!318 = !DIEnumerator(name: "Unknown", value: 3)
!319 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Discriminant$", scope: !320, file: !2, baseType: !68, size: 64, align: 64, flags: DIFlagEnumClass, elements: !83)
!320 = !DICompositeType(tag: DW_TAG_union_type, name: "enum$<core::option::Option<slice$<core::fmt::rt::v1::Argument> >, 1, 18446744073709551615, Some>", file: !2, size: 128, align: 64, elements: !321, templateParams: !363, identifier: "9f12058bb667a24b38934f7caa658ba4")
!321 = !{!322, !365}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "dataful_variant", scope: !320, file: !2, baseType: !323, size: 128, align: 64)
!323 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !320, file: !2, size: 128, align: 64, elements: !324, templateParams: !363, identifier: "9f12058bb667a24b38934f7caa658ba4::Some")
!324 = !{!325}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !323, file: !2, baseType: !326, size: 128, align: 64)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "slice$<core::fmt::rt::v1::Argument>", file: !2, size: 128, align: 64, elements: !327, templateParams: !79, identifier: "51a3f8d51de3c140666a7f399cafd84")
!327 = !{!328, !362}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !326, file: !2, baseType: !329, size: 64, align: 64)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ptr_const$<Argument>", baseType: !330, size: 64, align: 64, dwarfAddressSpace: 0)
!330 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !311, file: !2, size: 448, align: 64, elements: !331, templateParams: !79, identifier: "5cedcac9814cbf911535f483b20c17c7")
!331 = !{!332, !333}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !330, file: !2, baseType: !68, size: 64, align: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !330, file: !2, baseType: !334, size: 384, align: 64, offset: 64)
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !311, file: !2, size: 384, align: 64, elements: !335, templateParams: !79, identifier: "2fa51ffafee008ca951439ebb20b70cf")
!335 = !{!336, !338, !339, !342, !361}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !334, file: !2, baseType: !337, size: 32, align: 32, offset: 256)
!337 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_unsigned_char)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !334, file: !2, baseType: !310, size: 8, align: 8, offset: 320)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !334, file: !2, baseType: !340, size: 32, align: 32, offset: 288)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !2, baseType: !341)
!341 = !DIBasicType(name: "unsigned __int32", size: 32, encoding: DW_ATE_unsigned)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !334, file: !2, baseType: !343, size: 128, align: 64)
!343 = !DICompositeType(tag: DW_TAG_union_type, name: "enum$<core::fmt::rt::v1::Count>", file: !2, size: 128, align: 64, elements: !344, templateParams: !79, identifier: "ccce56050c87953c6357a40ad22ff917")
!344 = !{!345, !349, !353, !355}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "variant0", scope: !343, file: !2, baseType: !346, size: 128, align: 64, extraData: i64 0)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !343, file: !2, size: 128, align: 64, elements: !347, templateParams: !79, identifier: "ccce56050c87953c6357a40ad22ff917::Is")
!347 = !{!348}
!348 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !346, file: !2, baseType: !68, size: 64, align: 64, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "variant1", scope: !343, file: !2, baseType: !350, size: 128, align: 64, extraData: i64 1)
!350 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !343, file: !2, size: 128, align: 64, elements: !351, templateParams: !79, identifier: "ccce56050c87953c6357a40ad22ff917::Param")
!351 = !{!352}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !350, file: !2, baseType: !68, size: 64, align: 64, offset: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "variant2", scope: !343, file: !2, baseType: !354, size: 128, align: 64, extraData: i64 2)
!354 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !343, file: !2, size: 128, align: 64, elements: !79, templateParams: !79, identifier: "ccce56050c87953c6357a40ad22ff917::Implied")
!355 = !DIDerivedType(tag: DW_TAG_member, name: "discriminant", scope: !343, file: !2, baseType: !356, size: 64, align: 64)
!356 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Count", scope: !311, file: !2, baseType: !31, size: 64, align: 64, flags: DIFlagEnumClass, elements: !357)
!357 = !{!358, !359, !360}
!358 = !DIEnumerator(name: "Is", value: 0)
!359 = !DIEnumerator(name: "Param", value: 1)
!360 = !DIEnumerator(name: "Implied", value: 2)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !334, file: !2, baseType: !343, size: 128, align: 64, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !326, file: !2, baseType: !68, size: 64, align: 64, offset: 64)
!363 = !{!364}
!364 = !DITemplateTypeParameter(name: "T", type: !326)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "discriminant", scope: !320, file: !2, baseType: !319, size: 128, align: 64)
!366 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Discriminant$", scope: !367, file: !2, baseType: !68, size: 64, align: 64, flags: DIFlagEnumClass, elements: !83)
!367 = !DICompositeType(tag: DW_TAG_union_type, name: "enum$<core::option::Option<core::ptr::non_null::NonNull<u8> >, 1, 18446744073709551615, Some>", file: !2, size: 64, align: 64, elements: !368, templateParams: !376, identifier: "abf7ebe0fbb863e94b821d006e153b00")
!368 = !{!369, !378}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "dataful_variant", scope: !367, file: !2, baseType: !370, size: 64, align: 64)
!370 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !367, file: !2, size: 64, align: 64, elements: !371, templateParams: !376, identifier: "abf7ebe0fbb863e94b821d006e153b00::Some")
!371 = !{!372}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !370, file: !2, baseType: !373, size: 64, align: 64)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !174, file: !2, size: 64, align: 64, elements: !374, templateParams: !217, identifier: "f0162b2b2467ce72b0f8098786599f")
!374 = !{!375}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !373, file: !2, baseType: !66, size: 64, align: 64)
!376 = !{!377}
!377 = !DITemplateTypeParameter(name: "T", type: !373)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "discriminant", scope: !367, file: !2, baseType: !366, size: 64, align: 64)
!379 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !245, file: !2, baseType: !43, size: 8, align: 8, flags: DIFlagEnumClass, elements: !380)
!380 = !{!381, !382, !383, !384, !385}
!381 = !DIEnumerator(name: "Relaxed", value: 0)
!382 = !DIEnumerator(name: "Release", value: 1)
!383 = !DIEnumerator(name: "Acquire", value: 2)
!384 = !DIEnumerator(name: "AcqRel", value: 3)
!385 = !DIEnumerator(name: "SeqCst", value: 4)
!386 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Discriminant$", scope: !387, file: !2, baseType: !68, size: 64, align: 64, flags: DIFlagEnumClass, elements: !189)
!387 = !DICompositeType(tag: DW_TAG_union_type, name: "enum$<core::result::Result<core::ptr::non_null::NonNull<u8>,core::alloc::AllocError>, 1, 18446744073709551615, Ok>", file: !2, size: 64, align: 64, elements: !388, templateParams: !393, identifier: "34bca407b10e0122d30dcf6c41b67d26")
!388 = !{!389, !394}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "dataful_variant", scope: !387, file: !2, baseType: !390, size: 64, align: 64)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !387, file: !2, size: 64, align: 64, elements: !391, templateParams: !393, identifier: "34bca407b10e0122d30dcf6c41b67d26::Ok")
!391 = !{!392}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !390, file: !2, baseType: !373, size: 64, align: 64)
!393 = !{!377, !185}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "discriminant", scope: !387, file: !2, baseType: !386, size: 64, align: 64)
!395 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Discriminant$", scope: !396, file: !2, baseType: !68, size: 64, align: 64, flags: DIFlagEnumClass, elements: !83)
!396 = !DICompositeType(tag: DW_TAG_union_type, name: "enum$<core::option::Option<alloc::sync::WeakInner>, 1, 18446744073709551615, Some>", file: !2, size: 128, align: 64, elements: !397, templateParams: !407, identifier: "cda6d293493b6d15bf5600912dbbed94")
!397 = !{!398, !409}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "dataful_variant", scope: !396, file: !2, baseType: !399, size: 128, align: 64)
!399 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !396, file: !2, size: 128, align: 64, elements: !400, templateParams: !407, identifier: "cda6d293493b6d15bf5600912dbbed94::Some")
!400 = !{!401}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !399, file: !2, baseType: !402, size: 128, align: 64)
!402 = !DICompositeType(tag: DW_TAG_structure_type, name: "WeakInner", scope: !234, file: !2, size: 128, align: 64, elements: !403, templateParams: !79, identifier: "e42a81bc7434bd966fcdbc4174f9886b")
!403 = !{!404, !406}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !402, file: !2, baseType: !405, size: 64, align: 64)
!405 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ref$<AtomicUsize>", baseType: !244, size: 64, align: 64, dwarfAddressSpace: 0)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !402, file: !2, baseType: !405, size: 64, align: 64, offset: 64)
!407 = !{!408}
!408 = !DITemplateTypeParameter(name: "T", type: !402)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "discriminant", scope: !396, file: !2, baseType: !395, size: 128, align: 64)
!410 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Discriminant$", scope: !411, file: !2, baseType: !68, size: 64, align: 64, flags: DIFlagEnumClass, elements: !83)
!411 = !DICompositeType(tag: DW_TAG_union_type, name: "enum$<core::option::Option<tuple$<core::ptr::non_null::NonNull<u8>,core::alloc::layout::Layout> >, 1, 18446744073709551615, Some>", file: !2, size: 192, align: 64, elements: !412, templateParams: !431, identifier: "ba39880992f714a2b49f89eeb086d79b")
!412 = !{!413, !433}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "dataful_variant", scope: !411, file: !2, baseType: !414, size: 192, align: 64)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !411, file: !2, size: 192, align: 64, elements: !415, templateParams: !431, identifier: "ba39880992f714a2b49f89eeb086d79b::Some")
!415 = !{!416}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !414, file: !2, baseType: !417, size: 192, align: 64)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "tuple$<core::ptr::non_null::NonNull<u8>,core::alloc::layout::Layout>", file: !2, size: 192, align: 64, elements: !418, templateParams: !79, identifier: "daa58329d29191f55e0bc8c457d3ddc4")
!418 = !{!419, !420}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !417, file: !2, baseType: !373, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !417, file: !2, baseType: !421, size: 128, align: 64, offset: 64)
!421 = !DICompositeType(tag: DW_TAG_structure_type, name: "Layout", scope: !422, file: !2, size: 128, align: 64, elements: !423, templateParams: !79, identifier: "a3b37b9c6fc80150e8cfc35b93a2a480")
!422 = !DINamespace(name: "layout", scope: !187)
!423 = !{!424, !425}
!424 = !DIDerivedType(tag: DW_TAG_member, name: "size_", scope: !421, file: !2, baseType: !68, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "align_", scope: !421, file: !2, baseType: !426, size: 64, align: 64, offset: 64)
!426 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonZeroUsize", scope: !427, file: !2, size: 64, align: 64, elements: !429, templateParams: !79, identifier: "fd66ca0a70b9b265e6323401d93e9fa9")
!427 = !DINamespace(name: "nonzero", scope: !428)
!428 = !DINamespace(name: "num", scope: !30)
!429 = !{!430}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !426, file: !2, baseType: !68, size: 64, align: 64)
!431 = !{!432}
!432 = !DITemplateTypeParameter(name: "T", type: !417)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "discriminant", scope: !411, file: !2, baseType: !410, size: 192, align: 64)
!434 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ControlFlow", scope: !435, file: !2, baseType: !49, size: 64, align: 64, flags: DIFlagEnumClass, elements: !437)
!435 = !DINamespace(name: "control_flow", scope: !436)
!436 = !DINamespace(name: "ops", scope: !30)
!437 = !{!438, !439}
!438 = !DIEnumerator(name: "Continue", value: 0)
!439 = !DIEnumerator(name: "Break", value: 1)
!440 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Discriminant$", scope: !441, file: !2, baseType: !68, size: 64, align: 64, flags: DIFlagEnumClass, elements: !460)
!441 = !DICompositeType(tag: DW_TAG_union_type, name: "enum$<core::ops::control_flow::ControlFlow<enum$<core::result::Result<enum$<core::convert::Infallible>,core::alloc::AllocError>, Err>,core::ptr::non_null::NonNull<u8> >, 1, 18446744073709551615, Continue>", file: !2, size: 64, align: 64, elements: !442, templateParams: !447, identifier: "83f16ded0a8d6f6f268b4cac6ce34cc4")
!442 = !{!443, !459}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "dataful_variant", scope: !441, file: !2, baseType: !444, size: 64, align: 64)
!444 = !DICompositeType(tag: DW_TAG_structure_type, name: "Continue", scope: !441, file: !2, size: 64, align: 64, elements: !445, templateParams: !447, identifier: "83f16ded0a8d6f6f268b4cac6ce34cc4::Continue")
!445 = !{!446}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !444, file: !2, baseType: !373, size: 64, align: 64)
!447 = !{!448, !458}
!448 = !DITemplateTypeParameter(name: "B", type: !449)
!449 = !DICompositeType(tag: DW_TAG_union_type, name: "enum$<core::result::Result<enum$<core::convert::Infallible>,core::alloc::AllocError>, Err>", file: !2, align: 8, elements: !450, templateParams: !455, identifier: "1d73eb3dc47cc283c9d6ce89d72244ef")
!450 = !{!451}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !449, file: !2, baseType: !452, align: 8)
!452 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !449, file: !2, align: 8, elements: !453, templateParams: !455, identifier: "1d73eb3dc47cc283c9d6ce89d72244ef::Err")
!453 = !{!454}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !452, file: !2, baseType: !186, align: 8)
!455 = !{!456, !185}
!456 = !DITemplateTypeParameter(name: "T", type: !457)
!457 = !DICompositeType(tag: DW_TAG_union_type, name: "enum$<core::convert::Infallible>", file: !2, align: 8, elements: !79, templateParams: !79, identifier: "36bf84a4b766ab70a891737e37c5bc00")
!458 = !DITemplateTypeParameter(name: "C", type: !373)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "discriminant", scope: !441, file: !2, baseType: !440, size: 64, align: 64)
!460 = !{!461}
!461 = !DIEnumerator(name: "Break", value: 0, isUnsigned: true)
!462 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ControlFlow", scope: !435, file: !2, baseType: !31, size: 64, align: 64, flags: DIFlagEnumClass, elements: !437)
!463 = !{!0, !8, !13, !15, !17, !19}
!464 = distinct !DISubprogram(name: "call_once<tuple$<>,std::thread::impl$0::spawn_unchecked::closure$1::closure$0>", linkageName: "_ZN115_$LT$core..panic..unwind_safe..AssertUnwindSafe$LT$F$GT$$u20$as$u20$core..ops..function..FnOnce$LT$$LP$$RP$$GT$$GT$9call_once17h19b4e54c04c2fa2fE", scope: !466, file: !465, line: 270, type: !469, scopeLine: 270, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, templateParams: !497, retainedNodes: !494)
!465 = !DIFile(filename: "/rustc/f1edd0429582dd29cccacaf50fd134b05593bd9c\\library\\core\\src\\panic\\unwind_safe.rs", directory: "", checksumkind: CSK_SHA1, checksum: "245e2af4fa9ef6cdff884295d93ae6411f841168")
!466 = !DINamespace(name: "impl$23", scope: !467)
!467 = !DINamespace(name: "unwind_safe", scope: !468)
!468 = !DINamespace(name: "panic", scope: !30)
!469 = !DISubroutineType(types: !470)
!470 = !{null, !471}
!471 = !DICompositeType(tag: DW_TAG_structure_type, name: "AssertUnwindSafe<std::thread::impl$0::spawn_unchecked::closure$1::closure$0>", scope: !467, file: !2, size: 64, align: 64, elements: !472, templateParams: !492, identifier: "f7a5ceea89af2c31cd8c2b790824bbe2")
!472 = !{!473}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !471, file: !2, baseType: !474, size: 64, align: 64)
!474 = !DICompositeType(tag: DW_TAG_structure_type, name: "closure$0", scope: !475, file: !2, size: 64, align: 64, elements: !479, templateParams: !79, identifier: "2b228cacdc7103a48f83aef47c9b2c")
!475 = !DINamespace(name: "closure$1", scope: !476)
!476 = !DINamespace(name: "spawn_unchecked", scope: !477)
!477 = !DINamespace(name: "impl$0", scope: !478)
!478 = !DINamespace(name: "thread", scope: !60)
!479 = !{!480}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !474, file: !2, baseType: !481, size: 64, align: 64)
!481 = !DICompositeType(tag: DW_TAG_structure_type, name: "closure$0", scope: !482, file: !2, size: 64, align: 64, elements: !484, templateParams: !79, identifier: "a642897823b11020c79f7f8bd9ab70c")
!482 = !DINamespace(name: "main", scope: !483)
!483 = !DINamespace(name: "dr", scope: null)
!484 = !{!485}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "ptr0", scope: !481, file: !2, baseType: !486, size: 64, align: 64)
!486 = !DICompositeType(tag: DW_TAG_structure_type, name: "Sendable", scope: !483, file: !2, size: 64, align: 64, elements: !487, templateParams: !79, identifier: "e92539c948d4f35ebdc4cf27f4d51c72")
!487 = !{!488}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !486, file: !2, baseType: !489, size: 64, align: 64)
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ptr_mut$<i32>", baseType: !490, size: 64, align: 64, dwarfAddressSpace: 0)
!490 = !DIDerivedType(tag: DW_TAG_typedef, name: "i32", file: !2, baseType: !491)
!491 = !DIBasicType(name: "__int32", size: 32, encoding: DW_ATE_signed)
!492 = !{!493}
!493 = !DITemplateTypeParameter(name: "T", type: !474)
!494 = !{!495, !496}
!495 = !DILocalVariable(name: "self", arg: 1, scope: !464, file: !465, line: 270, type: !471)
!496 = !DILocalVariable(name: "_args", arg: 2, scope: !464, file: !465, line: 270, type: !5)
!497 = !{!498, !499}
!498 = !DITemplateTypeParameter(name: "R", type: !5)
!499 = !DITemplateTypeParameter(name: "F", type: !474)
!500 = !DILocation(line: 270, scope: !464)
!501 = !DILocation(line: 271, scope: !464)
!502 = !DILocation(line: 272, scope: !464)
!503 = distinct !DISubprogram(name: "call_once<tuple$<>,std::thread::impl$0::spawn_unchecked::closure$1::closure$0>", linkageName: "_ZN115_$LT$core..panic..unwind_safe..AssertUnwindSafe$LT$F$GT$$u20$as$u20$core..ops..function..FnOnce$LT$$LP$$RP$$GT$$GT$9call_once17hb83e5841b380cbb3E", scope: !466, file: !465, line: 270, type: !504, scopeLine: 270, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, templateParams: !520, retainedNodes: !517)
!504 = !DISubroutineType(types: !505)
!505 = !{null, !506}
!506 = !DICompositeType(tag: DW_TAG_structure_type, name: "AssertUnwindSafe<std::thread::impl$0::spawn_unchecked::closure$1::closure$0>", scope: !467, file: !2, size: 64, align: 64, elements: !507, templateParams: !515, identifier: "f7ef54032ba815042c39762fbc1411dd")
!507 = !{!508}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !506, file: !2, baseType: !509, size: 64, align: 64)
!509 = !DICompositeType(tag: DW_TAG_structure_type, name: "closure$0", scope: !475, file: !2, size: 64, align: 64, elements: !510, templateParams: !79, identifier: "802a712d6129145618b954a904f6df76")
!510 = !{!511}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !509, file: !2, baseType: !512, size: 64, align: 64)
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "closure$1", scope: !482, file: !2, size: 64, align: 64, elements: !513, templateParams: !79, identifier: "680b05e3bc9d2cce992cdfb8d679169d")
!513 = !{!514}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "ptr1", scope: !512, file: !2, baseType: !486, size: 64, align: 64)
!515 = !{!516}
!516 = !DITemplateTypeParameter(name: "T", type: !509)
!517 = !{!518, !519}
!518 = !DILocalVariable(name: "self", arg: 1, scope: !503, file: !465, line: 270, type: !506)
!519 = !DILocalVariable(name: "_args", arg: 2, scope: !503, file: !465, line: 270, type: !5)
!520 = !{!498, !521}
!521 = !DITemplateTypeParameter(name: "F", type: !509)
!522 = !DILocation(line: 270, scope: !503)
!523 = !DILocation(line: 271, scope: !503)
!524 = !DILocation(line: 272, scope: !503)
!525 = distinct !DISubprogram(name: "from<u8>", linkageName: "_ZN119_$LT$core..ptr..non_null..NonNull$LT$T$GT$$u20$as$u20$core..convert..From$LT$core..ptr..unique..Unique$LT$T$GT$$GT$$GT$4from17hf48f409b2236815fE", scope: !527, file: !526, line: 703, type: !528, scopeLine: 703, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, templateParams: !217, retainedNodes: !530)
!526 = !DIFile(filename: "/rustc/f1edd0429582dd29cccacaf50fd134b05593bd9c\\library\\core\\src\\ptr\\non_null.rs", directory: "", checksumkind: CSK_SHA1, checksum: "09c7c1041d467f78945daab2550a6168bc9a760f")
!527 = !DINamespace(name: "impl$16", scope: !174)
!528 = !DISubroutineType(types: !529)
!529 = !{!373, !210}
!530 = !{!531}
!531 = !DILocalVariable(name: "unique", arg: 1, scope: !525, file: !526, line: 703, type: !210)
!532 = !DILocation(line: 703, scope: !525)
!533 = !DILocation(line: 706, scope: !525)
!534 = !DILocation(line: 707, scope: !525)
!535 = distinct !DISubprogram(name: "from_residual<std::thread::JoinHandle<tuple$<> >,std::io::error::Error,std::io::error::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17h7f7bf4372c121145E", scope: !537, file: !536, line: 1912, type: !538, scopeLine: 1912, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, templateParams: !726, retainedNodes: !722)
!536 = !DIFile(filename: "/rustc/f1edd0429582dd29cccacaf50fd134b05593bd9c\\library\\core\\src\\result.rs", directory: "", checksumkind: CSK_SHA1, checksum: "1273845c4da48d138d39ba4402bfc6dc9bfaf497")
!537 = !DINamespace(name: "impl$37", scope: !29)
!538 = !DISubroutineType(types: !539)
!539 = !{!540, !715}
!540 = !DICompositeType(tag: DW_TAG_union_type, name: "enum$<core::result::Result<std::thread::JoinHandle<tuple$<> >,std::io::error::Error> >", file: !2, size: 320, align: 64, elements: !541, templateParams: !664, identifier: "239675c72f1cc620e73c5e73636c2781")
!541 = !{!542, !710, !714}
!542 = !DIDerivedType(tag: DW_TAG_member, name: "variant0", scope: !540, file: !2, baseType: !543, size: 320, align: 64, extraData: i64 0)
!543 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !540, file: !2, size: 320, align: 64, elements: !544, templateParams: !664, identifier: "239675c72f1cc620e73c5e73636c2781::Ok")
!544 = !{!545}
!545 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !543, file: !2, baseType: !546, size: 256, align: 64, offset: 64)
!546 = !DICompositeType(tag: DW_TAG_structure_type, name: "JoinHandle<tuple$<> >", scope: !478, file: !2, size: 256, align: 64, elements: !547, templateParams: !663, identifier: "3f527fa756eeb9fb4d43df666bb730a4")
!547 = !{!548}
!548 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !546, file: !2, baseType: !549, size: 256, align: 64)
!549 = !DICompositeType(tag: DW_TAG_structure_type, name: "JoinInner<tuple$<> >", scope: !478, file: !2, size: 256, align: 64, elements: !550, templateParams: !663, identifier: "e6aa10dd01aeefb7f5fb5358824d663a")
!550 = !{!551, !578, !625}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "native", scope: !549, file: !2, baseType: !552, size: 128, align: 64)
!552 = !DICompositeType(tag: DW_TAG_union_type, name: "enum$<core::option::Option<std::sys::windows::thread::Thread> >", file: !2, size: 128, align: 64, elements: !553, templateParams: !556, identifier: "eb184f55dfd5c966cd75f2da9ef4b2aa")
!553 = !{!554, !573, !577}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "variant0", scope: !552, file: !2, baseType: !555, size: 128, align: 64, extraData: i64 0)
!555 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !552, file: !2, size: 128, align: 64, elements: !79, templateParams: !556, identifier: "eb184f55dfd5c966cd75f2da9ef4b2aa::None")
!556 = !{!557}
!557 = !DITemplateTypeParameter(name: "T", type: !558)
!558 = !DICompositeType(tag: DW_TAG_structure_type, name: "Thread", scope: !559, file: !2, size: 64, align: 64, elements: !560, templateParams: !79, identifier: "c7cdcd2ea43f010adffe4223125cc7f5")
!559 = !DINamespace(name: "thread", scope: !269)
!560 = !{!561}
!561 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !558, file: !2, baseType: !562, size: 64, align: 64)
!562 = !DICompositeType(tag: DW_TAG_structure_type, name: "Handle", scope: !563, file: !2, size: 64, align: 64, elements: !564, templateParams: !79, identifier: "5771fefa101125fed3bda666cce6c950")
!563 = !DINamespace(name: "handle", scope: !269)
!564 = !{!565}
!565 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !562, file: !2, baseType: !566, size: 64, align: 64)
!566 = !DICompositeType(tag: DW_TAG_structure_type, name: "OwnedHandle", scope: !567, file: !2, size: 64, align: 64, elements: !571, templateParams: !79, identifier: "d0fbe2c5db7e651652f0f8782c5d76f3")
!567 = !DINamespace(name: "handle", scope: !568)
!568 = !DINamespace(name: "io", scope: !569)
!569 = !DINamespace(name: "windows", scope: !570)
!570 = !DINamespace(name: "os", scope: !60)
!571 = !{!572}
!572 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !566, file: !2, baseType: !280, size: 64, align: 64)
!573 = !DIDerivedType(tag: DW_TAG_member, name: "variant1", scope: !552, file: !2, baseType: !574, size: 128, align: 64, extraData: i64 1)
!574 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !552, file: !2, size: 128, align: 64, elements: !575, templateParams: !556, identifier: "eb184f55dfd5c966cd75f2da9ef4b2aa::Some")
!575 = !{!576}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !574, file: !2, baseType: !558, size: 64, align: 64, offset: 64)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "discriminant", scope: !552, file: !2, baseType: !36, size: 64, align: 64)
!578 = !DIDerivedType(tag: DW_TAG_member, name: "thread", scope: !549, file: !2, baseType: !579, size: 64, align: 64, offset: 128)
!579 = !DICompositeType(tag: DW_TAG_structure_type, name: "Thread", scope: !478, file: !2, size: 64, align: 64, elements: !580, templateParams: !79, identifier: "df1a97118677d47cbdbcd388da8a72ce")
!580 = !{!581}
!581 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !579, file: !2, baseType: !582, size: 64, align: 64)
!582 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::thread::Inner>", scope: !234, file: !2, size: 64, align: 64, elements: !583, templateParams: !619, identifier: "41544b199f299d486499d41d31679749")
!583 = !{!584, !623}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !582, file: !2, baseType: !585, size: 64, align: 64)
!585 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::thread::Inner> >", scope: !174, file: !2, size: 64, align: 64, elements: !586, templateParams: !621, identifier: "f2d1f444279ff84cfc0324449550e83c")
!586 = !{!587}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !585, file: !2, baseType: !588, size: 64, align: 64)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ptr_const$<ArcInner<std::thread::Inner> >", baseType: !589, size: 64, align: 64, dwarfAddressSpace: 0)
!589 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::thread::Inner>", scope: !234, file: !2, size: 384, align: 64, elements: !590, templateParams: !619, identifier: "24fbe01c01148a893348e00db317ebf0")
!590 = !{!591, !592, !593}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !589, file: !2, baseType: !244, size: 64, align: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !589, file: !2, baseType: !244, size: 64, align: 64, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !589, file: !2, baseType: !594, size: 256, align: 64, offset: 128)
!594 = !DICompositeType(tag: DW_TAG_structure_type, name: "Inner", scope: !478, file: !2, size: 256, align: 64, elements: !595, templateParams: !79, identifier: "bad20e7f0e0ba916a6b41b30fb7ceba")
!595 = !{!596, !597, !604}
!596 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !594, file: !2, baseType: !51, size: 128, align: 64)
!597 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !594, file: !2, baseType: !598, size: 64, align: 64, offset: 128)
!598 = !DICompositeType(tag: DW_TAG_structure_type, name: "ThreadId", scope: !478, file: !2, size: 64, align: 64, elements: !599, templateParams: !79, identifier: "286247d2acafd27e8320983ae2525c99")
!599 = !{!600}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !598, file: !2, baseType: !601, size: 64, align: 64)
!601 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonZeroU64", scope: !427, file: !2, size: 64, align: 64, elements: !602, templateParams: !79, identifier: "137da66f08cfc4d0b41720cc2c3303cd")
!602 = !{!603}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !601, file: !2, baseType: !31, size: 64, align: 64)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "parker", scope: !594, file: !2, baseType: !605, size: 8, align: 8, offset: 192)
!605 = !DICompositeType(tag: DW_TAG_structure_type, name: "Parker", scope: !606, file: !2, size: 8, align: 8, elements: !607, templateParams: !79, identifier: "16937474f06f2271ecf332cb812ca762")
!606 = !DINamespace(name: "thread_parker", scope: !269)
!607 = !{!608}
!608 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !605, file: !2, baseType: !609, size: 8, align: 8)
!609 = !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicI8", scope: !245, file: !2, size: 8, align: 8, elements: !610, templateParams: !79, identifier: "1d61bb347c5ffb9d7e2477ff08a030e5")
!610 = !{!611}
!611 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !609, file: !2, baseType: !612, size: 8, align: 8)
!612 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<i8>", scope: !250, file: !2, size: 8, align: 8, elements: !613, templateParams: !617, identifier: "f86d100e9fbf7fb58857a413fc2896bc")
!613 = !{!614}
!614 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !612, file: !2, baseType: !615, size: 8, align: 8)
!615 = !DIDerivedType(tag: DW_TAG_typedef, name: "i8", file: !2, baseType: !616)
!616 = !DIBasicType(name: "__int8", size: 8, encoding: DW_ATE_signed)
!617 = !{!618}
!618 = !DITemplateTypeParameter(name: "T", type: !615)
!619 = !{!620}
!620 = !DITemplateTypeParameter(name: "T", type: !594)
!621 = !{!622}
!622 = !DITemplateTypeParameter(name: "T", type: !589)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !582, file: !2, baseType: !624, align: 8)
!624 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::thread::Inner> >", scope: !216, file: !2, align: 8, elements: !79, templateParams: !621, identifier: "d9b258bf5a9fcdc4aeecf35fd6a9e364")
!625 = !DIDerivedType(tag: DW_TAG_member, name: "packet", scope: !549, file: !2, baseType: !626, size: 64, align: 64, offset: 192)
!626 = !DICompositeType(tag: DW_TAG_structure_type, name: "Packet<tuple$<> >", scope: !478, file: !2, size: 64, align: 64, elements: !627, templateParams: !663, identifier: "85626c43d02cc24ce0cb5a1ff123738")
!627 = !{!628}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !626, file: !2, baseType: !629, size: 64, align: 64)
!629 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<core::cell::UnsafeCell<enum$<core::option::Option<enum$<core::result::Result<tuple$<>,alloc::boxed::Box<dyn$<core::any::Any,core::marker::Send>,alloc::alloc::Global> >, 1, 18446744073709551615, Err> > > > >", scope: !234, file: !2, size: 64, align: 64, elements: !630, templateParams: !657, identifier: "bccea4f003f52d1bb39a4166e701904a")
!630 = !{!631, !661}
!631 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !629, file: !2, baseType: !632, size: 64, align: 64)
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<core::cell::UnsafeCell<enum$<core::option::Option<enum$<core::result::Result<tuple$<>,alloc::boxed::Box<dyn$<core::any::Any,core::marker::Send>,alloc::alloc::Global> >, 1, 18446744073709551615, Err> > > > > >", scope: !174, file: !2, size: 64, align: 64, elements: !633, templateParams: !659, identifier: "a3aa5e3b55f72d5e2c1b51f9a18dcba5")
!633 = !{!634}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !632, file: !2, baseType: !635, size: 64, align: 64)
!635 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ptr_const$<ArcInner<core::cell::UnsafeCell<enum$<core::option::Option<enum$<core::result::Result<tuple$<>,alloc::boxed::Box<dyn$<core::any::Any,core::marker::Send>,alloc::alloc::Global> >, 1, 18446744073709551615, Err> > > > > >", baseType: !636, size: 64, align: 64, dwarfAddressSpace: 0)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<core::cell::UnsafeCell<enum$<core::option::Option<enum$<core::result::Result<tuple$<>,alloc::boxed::Box<dyn$<core::any::Any,core::marker::Send>,alloc::alloc::Global> >, 1, 18446744073709551615, Err> > > > >", scope: !234, file: !2, size: 320, align: 64, elements: !637, templateParams: !657, identifier: "16f8ceb3c9abc0c4dc42a2b1d557022")
!637 = !{!638, !639, !640}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !636, file: !2, baseType: !244, size: 64, align: 64)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !636, file: !2, baseType: !244, size: 64, align: 64, offset: 64)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !636, file: !2, baseType: !641, size: 192, align: 64, offset: 128)
!641 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<enum$<core::option::Option<enum$<core::result::Result<tuple$<>,alloc::boxed::Box<dyn$<core::any::Any,core::marker::Send>,alloc::alloc::Global> >, 1, 18446744073709551615, Err> > > >", scope: !250, file: !2, size: 192, align: 64, elements: !642, templateParams: !655, identifier: "2a2e602ee27c9f1ef87a888da39be277")
!642 = !{!643}
!643 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !641, file: !2, baseType: !644, size: 192, align: 64)
!644 = !DICompositeType(tag: DW_TAG_union_type, name: "enum$<core::option::Option<enum$<core::result::Result<tuple$<>,alloc::boxed::Box<dyn$<core::any::Any,core::marker::Send>,alloc::alloc::Global> >, 1, 18446744073709551615, Err> > >", file: !2, size: 192, align: 64, elements: !645, templateParams: !648, identifier: "b4626bd438bfb3f2c1efdb5d05799e8d")
!645 = !{!646, !650, !654}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "variant0", scope: !644, file: !2, baseType: !647, size: 192, align: 64, extraData: i64 0)
!647 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !644, file: !2, size: 192, align: 64, elements: !79, templateParams: !648, identifier: "b4626bd438bfb3f2c1efdb5d05799e8d::None")
!648 = !{!649}
!649 = !DITemplateTypeParameter(name: "T", type: !87)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "variant1", scope: !644, file: !2, baseType: !651, size: 192, align: 64, extraData: i64 1)
!651 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !644, file: !2, size: 192, align: 64, elements: !652, templateParams: !648, identifier: "b4626bd438bfb3f2c1efdb5d05799e8d::Some")
!652 = !{!653}
!653 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !651, file: !2, baseType: !87, size: 128, align: 64, offset: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "discriminant", scope: !644, file: !2, baseType: !36, size: 64, align: 64)
!655 = !{!656}
!656 = !DITemplateTypeParameter(name: "T", type: !644)
!657 = !{!658}
!658 = !DITemplateTypeParameter(name: "T", type: !641)
!659 = !{!660}
!660 = !DITemplateTypeParameter(name: "T", type: !636)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !629, file: !2, baseType: !662, align: 8)
!662 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<core::cell::UnsafeCell<enum$<core::option::Option<enum$<core::result::Result<tuple$<>,alloc::boxed::Box<dyn$<core::any::Any,core::marker::Send>,alloc::alloc::Global> >, 1, 18446744073709551615, Err> > > > > >", scope: !216, file: !2, align: 8, elements: !79, templateParams: !659, identifier: "6a420af325baf3344662adea57c3a6ab")
!663 = !{!110}
!664 = !{!665, !666}
!665 = !DITemplateTypeParameter(name: "T", type: !546)
!666 = !DITemplateTypeParameter(name: "E", type: !667)
!667 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !116, file: !2, size: 128, align: 64, elements: !668, templateParams: !79, identifier: "35a649041b35d39eb953c30563bcceef")
!668 = !{!669}
!669 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !667, file: !2, baseType: !670, size: 128, align: 64)
!670 = !DICompositeType(tag: DW_TAG_union_type, name: "enum$<std::io::error::Repr>", file: !2, size: 128, align: 64, elements: !671, templateParams: !79, identifier: "66ec01e0f8715535dc4ee3587c9d6bc9")
!671 = !{!672, !676, !680, !690, !709}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "variant0", scope: !670, file: !2, baseType: !673, size: 128, align: 64, extraData: i64 0)
!673 = !DICompositeType(tag: DW_TAG_structure_type, name: "Os", scope: !670, file: !2, size: 128, align: 64, elements: !674, templateParams: !79, identifier: "66ec01e0f8715535dc4ee3587c9d6bc9::Os")
!674 = !{!675}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !673, file: !2, baseType: !490, size: 32, align: 32, offset: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "variant1", scope: !670, file: !2, baseType: !677, size: 128, align: 64, extraData: i64 1)
!677 = !DICompositeType(tag: DW_TAG_structure_type, name: "Simple", scope: !670, file: !2, size: 128, align: 64, elements: !678, templateParams: !79, identifier: "66ec01e0f8715535dc4ee3587c9d6bc9::Simple")
!678 = !{!679}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !677, file: !2, baseType: !123, size: 8, align: 8, offset: 8)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "variant2", scope: !670, file: !2, baseType: !681, size: 128, align: 64, extraData: i64 2)
!681 = !DICompositeType(tag: DW_TAG_structure_type, name: "SimpleMessage", scope: !670, file: !2, size: 128, align: 64, elements: !682, templateParams: !79, identifier: "66ec01e0f8715535dc4ee3587c9d6bc9::SimpleMessage")
!682 = !{!683, !684}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !681, file: !2, baseType: !123, size: 8, align: 8, offset: 8)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !681, file: !2, baseType: !685, size: 64, align: 64, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ref$<str>", baseType: !686, size: 64, align: 64, dwarfAddressSpace: 0)
!686 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", file: !2, size: 128, align: 64, elements: !687, templateParams: !79, identifier: "7ef2a91eecc7bcf4b4aaea2dbce79437")
!687 = !{!688, !689}
!688 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !686, file: !2, baseType: !66, size: 64, align: 64)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !686, file: !2, baseType: !68, size: 64, align: 64, offset: 64)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "variant3", scope: !670, file: !2, baseType: !691, size: 128, align: 64, extraData: i64 3)
!691 = !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !670, file: !2, size: 128, align: 64, elements: !692, templateParams: !79, identifier: "66ec01e0f8715535dc4ee3587c9d6bc9::Custom")
!692 = !{!693}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !691, file: !2, baseType: !694, size: 64, align: 64, offset: 64)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "Box<std::io::error::Custom,alloc::alloc::Global>", baseType: !695, size: 64, align: 64, dwarfAddressSpace: 0)
!695 = !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !116, file: !2, size: 192, align: 64, elements: !696, templateParams: !79, identifier: "e879ac5adb5384a930c4c31810f9013d")
!696 = !{!697, !698}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !695, file: !2, baseType: !123, size: 8, align: 8, offset: 128)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !695, file: !2, baseType: !699, size: 128, align: 64)
!699 = !DICompositeType(tag: DW_TAG_structure_type, name: "Box<dyn$<std::error::Error,core::marker::Send,core::marker::Sync>,alloc::alloc::Global>", scope: !94, file: !2, size: 128, align: 64, elements: !700, templateParams: !703, identifier: "cabb0e7ecbddf7b7f0905f4e0cfeed1d")
!700 = !{!701, !702}
!701 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !699, file: !2, baseType: !97, size: 64, align: 64, flags: DIFlagArtificial)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !699, file: !2, baseType: !99, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!703 = !{!704, !75}
!704 = !DITemplateTypeParameter(name: "T", type: !705)
!705 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn$<std::error::Error,core::marker::Send,core::marker::Sync>", file: !2, align: 8, elements: !706, templateParams: !79, identifier: "97308950ae4c1c3be754d1cc1a51625b")
!706 = !{!707, !708}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !705, file: !2, baseType: !97, size: 64, align: 64, flags: DIFlagArtificial)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !705, file: !2, baseType: !99, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!709 = !DIDerivedType(tag: DW_TAG_member, name: "discriminant", scope: !670, file: !2, baseType: !115, size: 8, align: 8)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "variant1", scope: !540, file: !2, baseType: !711, size: 320, align: 64, extraData: i64 1)
!711 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !540, file: !2, size: 320, align: 64, elements: !712, templateParams: !664, identifier: "239675c72f1cc620e73c5e73636c2781::Err")
!712 = !{!713}
!713 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !711, file: !2, baseType: !667, size: 128, align: 64, offset: 64)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "discriminant", scope: !540, file: !2, baseType: !28, size: 64, align: 64)
!715 = !DICompositeType(tag: DW_TAG_union_type, name: "enum$<core::result::Result<enum$<core::convert::Infallible>,std::io::error::Error>, Err>", file: !2, size: 128, align: 64, elements: !716, templateParams: !721, identifier: "1c7e2140d9aba019c7f9fda1b3b4fd5a")
!716 = !{!717}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !715, file: !2, baseType: !718, size: 128, align: 64)
!718 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !715, file: !2, size: 128, align: 64, elements: !719, templateParams: !721, identifier: "1c7e2140d9aba019c7f9fda1b3b4fd5a::Err")
!719 = !{!720}
!720 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !718, file: !2, baseType: !667, size: 128, align: 64)
!721 = !{!456, !666}
!722 = !{!723, !724}
!723 = !DILocalVariable(name: "residual", arg: 1, scope: !535, file: !536, line: 1912, type: !715)
!724 = !DILocalVariable(name: "e", scope: !725, file: !536, line: 1914, type: !667, align: 8)
!725 = distinct !DILexicalBlock(scope: !535, file: !536, line: 1914)
!726 = !{!665, !666, !727}
!727 = !DITemplateTypeParameter(name: "F", type: !667)
!728 = !DILocation(line: 1912, scope: !535)
!729 = !DILocation(line: 1914, scope: !725)
!730 = !DILocation(line: 1914, scope: !535)
!731 = !DILocation(line: 1916, scope: !535)
!732 = distinct !DISubprogram(name: "from_residual<core::ptr::non_null::NonNull<slice$<u8> >,core::alloc::AllocError,core::alloc::AllocError>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17hf384b764a0095808E", scope: !537, file: !536, line: 1912, type: !733, scopeLine: 1912, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, templateParams: !739, retainedNodes: !735)
!733 = !DISubroutineType(types: !734)
!734 = !{!167, !449}
!735 = !{!736, !737}
!736 = !DILocalVariable(name: "residual", arg: 1, scope: !732, file: !536, line: 1912, type: !449)
!737 = !DILocalVariable(name: "e", scope: !738, file: !536, line: 1914, type: !186, align: 1)
!738 = distinct !DILexicalBlock(scope: !732, file: !536, line: 1914)
!739 = !{!184, !185, !740}
!740 = !DITemplateTypeParameter(name: "F", type: !186)
!741 = !DILocation(line: 1912, scope: !732)
!742 = !DILocation(line: 1914, scope: !738)
!743 = !DILocation(line: 1916, scope: !732)
!744 = distinct !DISubprogram(name: "__rust_begin_short_backtrace<dr::main::closure$1,tuple$<> >", linkageName: "_ZN3std10sys_common9backtrace28__rust_begin_short_backtrace17h25948d8b55f7f57bE", scope: !746, file: !745, line: 119, type: !747, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, templateParams: !753, retainedNodes: !749)
!745 = !DIFile(filename: "/rustc/f1edd0429582dd29cccacaf50fd134b05593bd9c\\library\\std\\src\\sys_common\\backtrace.rs", directory: "", checksumkind: CSK_SHA1, checksum: "7481dba50ead6f6229f49a1b24a1d4d6f773742a")
!746 = !DINamespace(name: "backtrace", scope: !264)
!747 = !DISubroutineType(types: !748)
!748 = !{null, !512}
!749 = !{!750, !751}
!750 = !DILocalVariable(name: "f", arg: 1, scope: !744, file: !745, line: 119, type: !512)
!751 = !DILocalVariable(name: "result", scope: !752, file: !745, line: 123, type: !5, align: 1)
!752 = distinct !DILexicalBlock(scope: !744, file: !745, line: 123)
!753 = !{!754, !110}
!754 = !DITemplateTypeParameter(name: "F", type: !512)
!755 = !DILocation(line: 123, scope: !752)
!756 = !DILocation(line: 119, scope: !744)
!757 = !DILocation(line: 123, scope: !744)
!758 = !DILocation(line: 126, scope: !752)
!759 = !DILocation(line: 129, scope: !744)
!760 = distinct !DISubprogram(name: "__rust_begin_short_backtrace<dr::main::closure$0,tuple$<> >", linkageName: "_ZN3std10sys_common9backtrace28__rust_begin_short_backtrace17hb91a1a719288532eE", scope: !746, file: !745, line: 119, type: !761, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, templateParams: !767, retainedNodes: !763)
!761 = !DISubroutineType(types: !762)
!762 = !{null, !481}
!763 = !{!764, !765}
!764 = !DILocalVariable(name: "f", arg: 1, scope: !760, file: !745, line: 119, type: !481)
!765 = !DILocalVariable(name: "result", scope: !766, file: !745, line: 123, type: !5, align: 1)
!766 = distinct !DILexicalBlock(scope: !760, file: !745, line: 123)
!767 = !{!768, !110}
!768 = !DITemplateTypeParameter(name: "F", type: !481)
!769 = !DILocation(line: 123, scope: !766)
!770 = !DILocation(line: 119, scope: !760)
!771 = !DILocation(line: 123, scope: !760)
!772 = !DILocation(line: 126, scope: !766)
!773 = !DILocation(line: 129, scope: !760)
!774 = distinct !DISubprogram(name: "__rust_begin_short_backtrace<void (*)(),tuple$<> >", linkageName: "_ZN3std10sys_common9backtrace28__rust_begin_short_backtrace17hd9da278b50f2acddE", scope: !746, file: !745, line: 119, type: !775, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, templateParams: !784, retainedNodes: !780)
!775 = !DISubroutineType(types: !776)
!776 = !{null, !777}
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void (*)()", baseType: !778, size: 64, align: 64, dwarfAddressSpace: 0)
!778 = !DISubroutineType(types: !779)
!779 = !{null}
!780 = !{!781, !782}
!781 = !DILocalVariable(name: "f", arg: 1, scope: !774, file: !745, line: 119, type: !777)
!782 = !DILocalVariable(name: "result", scope: !783, file: !745, line: 123, type: !5, align: 1)
!783 = distinct !DILexicalBlock(scope: !774, file: !745, line: 123)
!784 = !{!785, !110}
!785 = !DITemplateTypeParameter(name: "F", type: !777)
!786 = !DILocation(line: 123, scope: !783)
!787 = !DILocation(line: 119, scope: !774)
!788 = !DILocation(line: 123, scope: !774)
!789 = !DILocation(line: 126, scope: !783)
!790 = !DILocation(line: 129, scope: !774)
!791 = distinct !DISubprogram(name: "lang_start<tuple$<> >", linkageName: "_ZN3std2rt10lang_start17ha579689bb1e0df71E", scope: !793, file: !792, line: 140, type: !794, scopeLine: 140, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, templateParams: !663, retainedNodes: !799)
!792 = !DIFile(filename: "/rustc/f1edd0429582dd29cccacaf50fd134b05593bd9c\\library\\std\\src\\rt.rs", directory: "", checksumkind: CSK_SHA1, checksum: "597960a6bbe3770d8b00da46c70b0aa1a1e7a6d7")
!793 = !DINamespace(name: "rt", scope: !60)
!794 = !DISubroutineType(types: !795)
!795 = !{!796, !777, !796, !798}
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "isize", file: !2, baseType: !797)
!797 = !DIBasicType(name: "ptrdiff_t", size: 64, encoding: DW_ATE_signed)
!798 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ptr_const$<ptr_const$<u8> >", baseType: !66, size: 64, align: 64, dwarfAddressSpace: 0)
!799 = !{!800, !801, !802, !803}
!800 = !DILocalVariable(name: "main", arg: 1, scope: !791, file: !792, line: 141, type: !777)
!801 = !DILocalVariable(name: "argc", arg: 2, scope: !791, file: !792, line: 142, type: !796)
!802 = !DILocalVariable(name: "argv", arg: 3, scope: !791, file: !792, line: 143, type: !798)
!803 = !DILocalVariable(name: "v", scope: !804, file: !792, line: 145, type: !796, align: 8)
!804 = distinct !DILexicalBlock(scope: !791, file: !792, line: 145)
!805 = !DILocation(line: 141, scope: !791)
!806 = !DILocation(line: 142, scope: !791)
!807 = !DILocation(line: 143, scope: !791)
!808 = !DILocation(line: 146, scope: !791)
!809 = !DILocation(line: 145, scope: !791)
!810 = !DILocation(line: 145, scope: !804)
!811 = !DILocation(line: 151, scope: !791)
!812 = distinct !DISubprogram(name: "closure$0<tuple$<> >", linkageName: "_ZN3std2rt10lang_start28_$u7b$$u7b$closure$u7d$$u7d$17h09dffa04fc7fe740E", scope: !813, file: !792, line: 146, type: !814, scopeLine: 146, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, templateParams: !663, retainedNodes: !820)
!813 = !DINamespace(name: "lang_start", scope: !793)
!814 = !DISubroutineType(types: !815)
!815 = !{!490, !816}
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ref$<closure$0>", baseType: !817, size: 64, align: 64, dwarfAddressSpace: 0)
!817 = !DICompositeType(tag: DW_TAG_structure_type, name: "closure$0", scope: !813, file: !2, size: 64, align: 64, elements: !818, templateParams: !79, identifier: "8e4da3de4eea775afcf16c7d920eb9d")
!818 = !{!819}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !817, file: !2, baseType: !777, size: 64, align: 64)
!820 = !{!821}
!821 = !DILocalVariable(name: "main", scope: !812, file: !792, line: 141, type: !777, align: 8)
!822 = !DILocation(line: 141, scope: !812)
!823 = !DILocation(line: 146, scope: !812)
!824 = distinct !DISubprogram(name: "new<alloc::string::String>", linkageName: "_ZN3std3ffi5c_str7CString3new17h386e73601ceb5f29E", scope: !57, file: !825, line: 376, type: !826, scopeLine: 376, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, templateParams: !223, retainedNodes: !845)
!825 = !DIFile(filename: "/rustc/f1edd0429582dd29cccacaf50fd134b05593bd9c\\library\\std\\src\\ffi\\c_str.rs", directory: "", checksumkind: CSK_SHA1, checksum: "891709dcdb093e6c47c193d70060d51ca1e99dc8")
!826 = !DISubroutineType(types: !827)
!827 = !{!828, !198}
!828 = !DICompositeType(tag: DW_TAG_union_type, name: "enum$<core::result::Result<std::ffi::c_str::CString,std::ffi::c_str::NulError> >", file: !2, size: 320, align: 64, elements: !829, templateParams: !834, identifier: "314f04de9e34b6e6a41e600580e68012")
!829 = !{!830, !840, !844}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "variant0", scope: !828, file: !2, baseType: !831, size: 320, align: 64, extraData: i64 0)
!831 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !828, file: !2, size: 320, align: 64, elements: !832, templateParams: !834, identifier: "314f04de9e34b6e6a41e600580e68012::Ok")
!832 = !{!833}
!833 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !831, file: !2, baseType: !57, size: 128, align: 64, offset: 64)
!834 = !{!81, !835}
!835 = !DITemplateTypeParameter(name: "E", type: !836)
!836 = !DICompositeType(tag: DW_TAG_structure_type, name: "NulError", scope: !58, file: !2, size: 256, align: 64, elements: !837, templateParams: !79, identifier: "b9036cf36cc8d2f5695b0ec3d3a57e3")
!837 = !{!838, !839}
!838 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !836, file: !2, baseType: !68, size: 64, align: 64)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !836, file: !2, baseType: !202, size: 192, align: 64, offset: 64)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "variant1", scope: !828, file: !2, baseType: !841, size: 320, align: 64, extraData: i64 1)
!841 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !828, file: !2, size: 320, align: 64, elements: !842, templateParams: !834, identifier: "314f04de9e34b6e6a41e600580e68012::Err")
!842 = !{!843}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !841, file: !2, baseType: !836, size: 256, align: 64, offset: 64)
!844 = !DIDerivedType(tag: DW_TAG_member, name: "discriminant", scope: !828, file: !2, baseType: !28, size: 64, align: 64)
!845 = !{!846}
!846 = !DILocalVariable(name: "t", arg: 1, scope: !824, file: !825, line: 376, type: !198)
!847 = !DILocation(line: 376, scope: !824)
!848 = !DILocation(line: 401, scope: !824)
!849 = !DILocation(line: 402, scope: !824)
!850 = distinct !DISubprogram(name: "as_i32", linkageName: "_ZN3std3sys7windows7process8ExitCode6as_i3217h6bdb28acd5e095c1E", scope: !852, file: !851, line: 540, type: !856, scopeLine: 540, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, templateParams: !79, retainedNodes: !859)
!851 = !DIFile(filename: "/rustc/f1edd0429582dd29cccacaf50fd134b05593bd9c\\library\\std\\src\\sys\\windows\\process.rs", directory: "", checksumkind: CSK_SHA1, checksum: "f92da8c761b5c6d68870462ec738db5b47d28b46")
!852 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !853, file: !2, size: 32, align: 32, elements: !854, templateParams: !79, identifier: "4883ccfa522087afb9ce066b3c14ebc5")
!853 = !DINamespace(name: "process", scope: !269)
!854 = !{!855}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !852, file: !2, baseType: !340, size: 32, align: 32)
!856 = !DISubroutineType(types: !857)
!857 = !{!490, !858}
!858 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ref$<ExitCode>", baseType: !852, size: 64, align: 64, dwarfAddressSpace: 0)
!859 = !{!860}
!860 = !DILocalVariable(name: "self", arg: 1, scope: !850, file: !851, line: 540, type: !858)
!861 = !DILocation(line: 540, scope: !850)
!862 = !DILocation(line: 541, scope: !850)
!863 = !DILocation(line: 542, scope: !850)
!864 = distinct !DISubprogram(name: "catch_unwind<core::panic::unwind_safe::AssertUnwindSafe<std::thread::impl$0::spawn_unchecked::closure$1::closure$0>,tuple$<> >", linkageName: "_ZN3std5panic12catch_unwind17h2d98e70a3908403fE", scope: !866, file: !865, line: 132, type: !867, scopeLine: 132, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, templateParams: !871, retainedNodes: !869)
!865 = !DIFile(filename: "/rustc/f1edd0429582dd29cccacaf50fd134b05593bd9c\\library\\std\\src\\panic.rs", directory: "", checksumkind: CSK_SHA1, checksum: "94dd4fb643f8d131b7fd283070f42b27079706a7")
!866 = !DINamespace(name: "panic", scope: !60)
!867 = !DISubroutineType(types: !868)
!868 = !{!87, !506}
!869 = !{!870}
!870 = !DILocalVariable(name: "f", arg: 1, scope: !864, file: !865, line: 132, type: !506)
!871 = !{!872, !498}
!872 = !DITemplateTypeParameter(name: "F", type: !506)
!873 = !DILocation(line: 132, scope: !864)
!874 = !DILocation(line: 133, scope: !864)
!875 = !DILocation(line: 134, scope: !864)
!876 = distinct !DISubprogram(name: "catch_unwind<core::panic::unwind_safe::AssertUnwindSafe<std::thread::impl$0::spawn_unchecked::closure$1::closure$0>,tuple$<> >", linkageName: "_ZN3std5panic12catch_unwind17h7e237880ed433efcE", scope: !866, file: !865, line: 132, type: !877, scopeLine: 132, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, templateParams: !881, retainedNodes: !879)
!877 = !DISubroutineType(types: !878)
!878 = !{!87, !471}
!879 = !{!880}
!880 = !DILocalVariable(name: "f", arg: 1, scope: !876, file: !865, line: 132, type: !471)
!881 = !{!882, !498}
!882 = !DITemplateTypeParameter(name: "F", type: !471)
!883 = !DILocation(line: 132, scope: !876)
!884 = !DILocation(line: 133, scope: !876)
!885 = !DILocation(line: 134, scope: !876)
!886 = distinct !DISubprogram(name: "join<tuple$<> >", linkageName: "_ZN3std6thread18JoinInner$LT$T$GT$4join17h28d74c77184de8abE", scope: !549, file: !887, line: 1269, type: !888, scopeLine: 1269, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, templateParams: !663, retainedNodes: !891)
!887 = !DIFile(filename: "/rustc/f1edd0429582dd29cccacaf50fd134b05593bd9c\\library\\std\\src\\thread\\mod.rs", directory: "", checksumkind: CSK_SHA1, checksum: "94b2a53bb60aaaecb812c2a184114784ce3cce98")
!888 = !DISubroutineType(types: !889)
!889 = !{!87, !890}
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ref_mut$<JoinInner<tuple$<> > >", baseType: !549, size: 64, align: 64, dwarfAddressSpace: 0)
!891 = !{!892}
!892 = !DILocalVariable(name: "self", arg: 1, scope: !886, file: !887, line: 1269, type: !890)
!893 = !DILocation(line: 1269, scope: !886)
!894 = !DILocation(line: 1270, scope: !886)
!895 = !DILocation(line: 1271, scope: !886)
!896 = !DILocalVariable(name: "self", arg: 1, scope: !897, file: !898, line: 1905, type: !902)
!897 = distinct !DISubprogram(name: "get<enum$<core::option::Option<enum$<core::result::Result<tuple$<>,alloc::boxed::Box<dyn$<core::any::Any,core::marker::Send>,alloc::alloc::Global> >, 1, 18446744073709551615, Err> > > >", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3get17h2598e22f133679c8E", scope: !641, file: !898, line: 1905, type: !899, scopeLine: 1905, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, templateParams: !655, retainedNodes: !903)
!898 = !DIFile(filename: "/rustc/f1edd0429582dd29cccacaf50fd134b05593bd9c\\library\\core\\src\\cell.rs", directory: "", checksumkind: CSK_SHA1, checksum: "afe27c7abe54201eaf4ea6f307bc5c4dbbdd1405")
!899 = !DISubroutineType(types: !900)
!900 = !{!901, !902}
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ptr_mut$<enum$<core::option::Option<enum$<core::result::Result<tuple$<>,alloc::boxed::Box<dyn$<core::any::Any,core::marker::Send>,alloc::alloc::Global> >, 1, 18446744073709551615, Err> > > >", baseType: !644, size: 64, align: 64, dwarfAddressSpace: 0)
!902 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ref$<UnsafeCell<enum$<core::option::Option<enum$<core::result::Result<tuple$<>,alloc::boxed::Box<dyn$<core::any::Any,core::marker::Send>,alloc::alloc::Global> >, 1, 18446744073709551615, Err> > > > >", baseType: !641, size: 64, align: 64, dwarfAddressSpace: 0)
!903 = !{!896}
!904 = !DILocation(line: 1905, scope: !897, inlinedAt: !905)
!905 = distinct !DILocation(line: 1271, scope: !886)
!906 = !DILocation(line: 1909, scope: !897, inlinedAt: !905)
!907 = !DILocation(line: 1272, scope: !886)
!908 = distinct !DISubprogram(name: "join<tuple$<> >", linkageName: "_ZN3std6thread19JoinHandle$LT$T$GT$4join17h6a5f07f1d77b5f49E", scope: !546, file: !887, line: 1401, type: !909, scopeLine: 1401, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, templateParams: !663, retainedNodes: !911)
!909 = !DISubroutineType(types: !910)
!910 = !{!87, !546}
!911 = !{!912}
!912 = !DILocalVariable(name: "self", arg: 1, scope: !908, file: !887, line: 1401, type: !546)
!913 = !DILocation(line: 1401, scope: !908)
!914 = !DILocation(line: 1402, scope: !908)
!915 = !DILocation(line: 1403, scope: !908)
!916 = distinct !DISubprogram(name: "spawn<dr::main::closure$1,tuple$<> >", linkageName: "_ZN3std6thread5spawn17h5474f27c2e4d6bcaE", scope: !478, file: !887, line: 624, type: !917, scopeLine: 624, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, templateParams: !753, retainedNodes: !919)
!917 = !DISubroutineType(types: !918)
!918 = !{!546, !512}
!919 = !{!920}
!920 = !DILocalVariable(name: "f", arg: 1, scope: !916, file: !887, line: 624, type: !512)
!921 = !DILocation(line: 624, scope: !916)
!922 = !DILocation(line: 630, scope: !916)
!923 = !DILocation(line: 631, scope: !916)
!924 = !{i8 0, i8 2}
!925 = distinct !DISubprogram(name: "spawn<dr::main::closure$0,tuple$<> >", linkageName: "_ZN3std6thread5spawn17hc9f3a806c17e99d8E", scope: !478, file: !887, line: 624, type: !926, scopeLine: 624, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, templateParams: !767, retainedNodes: !928)
!926 = !DISubroutineType(types: !927)
!927 = !{!546, !481}
!928 = !{!929}
!929 = !DILocalVariable(name: "f", arg: 1, scope: !925, file: !887, line: 624, type: !481)
!930 = !DILocation(line: 624, scope: !925)
!931 = !DILocation(line: 630, scope: !925)
!932 = !DILocation(line: 631, scope: !925)
!933 = distinct !DISubprogram(name: "spawn_unchecked<dr::main::closure$1,tuple$<> >", linkageName: "_ZN3std6thread7Builder15spawn_unchecked17h262f9a1e847950a8E", scope: !934, file: !887, line: 450, type: !947, scopeLine: 450, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, templateParams: !753, retainedNodes: !949)
!934 = !DICompositeType(tag: DW_TAG_structure_type, name: "Builder", scope: !478, file: !2, size: 320, align: 64, elements: !935, templateParams: !79, identifier: "b59091f5be1294a972d8e09ff7cf188f")
!935 = !{!936, !937}
!936 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !934, file: !2, baseType: !192, size: 192, align: 64)
!937 = !DIDerivedType(tag: DW_TAG_member, name: "stack_size", scope: !934, file: !2, baseType: !938, size: 128, align: 64, offset: 192)
!938 = !DICompositeType(tag: DW_TAG_union_type, name: "enum$<core::option::Option<usize> >", file: !2, size: 128, align: 64, elements: !939, templateParams: !253, identifier: "f19787a163da56c09a842fffdb11add7")
!939 = !{!940, !942, !946}
!940 = !DIDerivedType(tag: DW_TAG_member, name: "variant0", scope: !938, file: !2, baseType: !941, size: 128, align: 64, extraData: i64 0)
!941 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !938, file: !2, size: 128, align: 64, elements: !79, templateParams: !253, identifier: "f19787a163da56c09a842fffdb11add7::None")
!942 = !DIDerivedType(tag: DW_TAG_member, name: "variant1", scope: !938, file: !2, baseType: !943, size: 128, align: 64, extraData: i64 1)
!943 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !938, file: !2, size: 128, align: 64, elements: !944, templateParams: !253, identifier: "f19787a163da56c09a842fffdb11add7::Some")
!944 = !{!945}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !943, file: !2, baseType: !68, size: 64, align: 64, offset: 64)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "discriminant", scope: !938, file: !2, baseType: !36, size: 64, align: 64)
!947 = !DISubroutineType(types: !948)
!948 = !{!540, !934, !512}
!949 = !{!950, !951, !952, !954, !955, !957, !959, !961, !963, !965, !967, !975, !977}
!950 = !DILocalVariable(name: "self", arg: 1, scope: !933, file: !887, line: 450, type: !934)
!951 = !DILocalVariable(name: "f", arg: 2, scope: !933, file: !887, line: 450, type: !512)
!952 = !DILocalVariable(name: "name", scope: !953, file: !887, line: 456, type: !192, align: 8)
!953 = distinct !DILexicalBlock(scope: !933, file: !887, line: 456)
!954 = !DILocalVariable(name: "stack_size", scope: !953, file: !887, line: 456, type: !938, align: 8)
!955 = !DILocalVariable(name: "stack_size", scope: !956, file: !887, line: 458, type: !68, align: 8)
!956 = distinct !DILexicalBlock(scope: !953, file: !887, line: 458)
!957 = !DILocalVariable(name: "my_thread", scope: !958, file: !887, line: 460, type: !579, align: 8)
!958 = distinct !DILexicalBlock(scope: !956, file: !887, line: 460)
!959 = !DILocalVariable(name: "their_thread", scope: !960, file: !887, line: 463, type: !579, align: 8)
!960 = distinct !DILexicalBlock(scope: !958, file: !887, line: 463)
!961 = !DILocalVariable(name: "my_packet", scope: !962, file: !887, line: 465, type: !629, align: 8)
!962 = distinct !DILexicalBlock(scope: !960, file: !887, line: 465)
!963 = !DILocalVariable(name: "their_packet", scope: !964, file: !887, line: 466, type: !629, align: 8)
!964 = distinct !DILexicalBlock(scope: !962, file: !887, line: 466)
!965 = !DILocalVariable(name: "output_capture", scope: !966, file: !887, line: 468, type: !227, align: 8)
!966 = distinct !DILexicalBlock(scope: !964, file: !887, line: 468)
!967 = !DILocalVariable(name: "main", scope: !968, file: !887, line: 471, type: !969, align: 8)
!968 = distinct !DILexicalBlock(scope: !966, file: !887, line: 471)
!969 = !DICompositeType(tag: DW_TAG_structure_type, name: "closure$1", scope: !476, file: !2, size: 256, align: 64, elements: !970, templateParams: !79, identifier: "7a414bb0a171fea9ffd7e16da3c4c35b")
!970 = !{!971, !972, !973, !974}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "their_thread", scope: !969, file: !2, baseType: !579, size: 64, align: 64)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "output_capture", scope: !969, file: !2, baseType: !227, size: 64, align: 64, offset: 64)
!973 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !969, file: !2, baseType: !512, size: 64, align: 64, offset: 128)
!974 = !DIDerivedType(tag: DW_TAG_member, name: "their_packet", scope: !969, file: !2, baseType: !629, size: 64, align: 64, offset: 192)
!975 = !DILocalVariable(name: "residual", scope: !976, file: !887, line: 512, type: !715, align: 8)
!976 = distinct !DILexicalBlock(scope: !968, file: !887, line: 512)
!977 = !DILocalVariable(name: "val", scope: !978, file: !887, line: 507, type: !558, align: 8)
!978 = distinct !DILexicalBlock(scope: !968, file: !887, line: 507)
!979 = !DILocation(line: 450, scope: !933)
!980 = !DILocation(line: 456, scope: !953)
!981 = !DILocation(line: 460, scope: !958)
!982 = !DILocation(line: 463, scope: !960)
!983 = !DILocation(line: 465, scope: !962)
!984 = !DILocation(line: 466, scope: !964)
!985 = !DILocation(line: 468, scope: !966)
!986 = !DILocation(line: 471, scope: !968)
!987 = !DILocation(line: 512, scope: !976)
!988 = !DILocation(line: 456, scope: !933)
!989 = !{i64 0, i64 2}
!990 = !DILocation(line: 458, scope: !953)
!991 = !DILocation(line: 458, scope: !956)
!992 = !DILocation(line: 460, scope: !956)
!993 = !DILocation(line: 517, scope: !933)
!994 = !DILocation(line: 463, scope: !958)
!995 = !DILocation(line: 465, scope: !960)
!996 = !{!997}
!997 = distinct !{!997, !998, !"_ZN4core4cell19UnsafeCell$LT$T$GT$3new17h6408c339d78a1308E: argument 0"}
!998 = distinct !{!998, !"_ZN4core4cell19UnsafeCell$LT$T$GT$3new17h6408c339d78a1308E"}
!999 = !{!1000}
!1000 = distinct !{!1000, !998, !"_ZN4core4cell19UnsafeCell$LT$T$GT$3new17h6408c339d78a1308E: %value"}
!1001 = !DILocalVariable(name: "value", arg: 1, scope: !1002, file: !898, line: 1862, type: !644)
!1002 = distinct !DISubprogram(name: "new<enum$<core::option::Option<enum$<core::result::Result<tuple$<>,alloc::boxed::Box<dyn$<core::any::Any,core::marker::Send>,alloc::alloc::Global> >, 1, 18446744073709551615, Err> > > >", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3new17h6408c339d78a1308E", scope: !641, file: !898, line: 1862, type: !1003, scopeLine: 1862, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !25, templateParams: !655, retainedNodes: !1005)
!1003 = !DISubroutineType(types: !1004)
!1004 = !{!641, !644}
!1005 = !{!1001}
!1006 = !DILocation(line: 1862, scope: !1002, inlinedAt: !1007)
!1007 = distinct !DILocation(line: 465, scope: !960)
!1008 = !DILocation(line: 1863, scope: !1002, inlinedAt: !1007)
!1009 = !DILocation(line: 1864, scope: !1002, inlinedAt: !1007)
!1010 = !DILocation(line: 517, scope: !956)
!1011 = !DILocation(line: 517, scope: !958)
!1012 = !DILocation(line: 466, scope: !962)
!1013 = !DILocation(line: 468, scope: !964)
!1014 = !DILocation(line: 517, scope: !960)
!1015 = !DILocation(line: 469, scope: !966)
!1016 = !DILocation(line: 517, scope: !962)
!1017 = !DILocation(line: 517, scope: !964)
!1018 = !DILocation(line: 471, scope: !966)
!1019 = !DILocation(line: 510, scope: !968)
!1020 = !{!1021}
!1021 = distinct !{!1021, !1022, !"_ZN5alloc5boxed12Box$LT$T$GT$3new17h7ab81905c7dd2cedE: %x"}
!1022 = distinct !{!1022, !"_ZN5alloc5boxed12Box$LT$T$GT$3new17h7ab81905c7dd2cedE"}
!1023 = !DILocalVariable(name: "x", arg: 1, scope: !1024, file: !1025, line: 191, type: !969)
