; ModuleID = 'move.ac200f22-cgu.0'
source_filename = "move.ac200f22-cgu.0"
target datalayout = "e-m:w-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-windows-msvc"

%"core::fmt::Formatter" = type { { i64, i64 }, { i64, i64 }, { {}*, [3 x i64]* }, i32, i32, i8, [7 x i8] }
%"core::fmt::Opaque" = type {}
%"core::fmt::Arguments" = type { { [0 x { [0 x i8]*, i64 }]*, i64 }, { i64*, i64 }, { [0 x { i8*, i64* }]*, i64 } }
%"core::fmt::rt::v1::Argument" = type { i64, %"core::fmt::rt::v1::FormatSpec" }
%"core::fmt::rt::v1::FormatSpec" = type { { i64, i64 }, { i64, i64 }, i32, i32, i8, [7 x i8] }
%"core::fmt::UnsafeArg" = type { {} }

@vtable.0 = private unnamed_addr constant <{ i8*, [16 x i8], i8*, i8*, i8*, [0 x i8] }> <{ i8* bitcast (void (i64**)* @"_ZN4core3ptr85drop_in_place$LT$std..rt..lang_start$LT$$LP$$RP$$GT$..$u7b$$u7b$closure$u7d$$u7d$$GT$17h6006087de8b26dfbE" to i8*), [16 x i8] c"\08\00\00\00\00\00\00\00\08\00\00\00\00\00\00\00", i8* bitcast (i32 (i64**)* @"_ZN4core3ops8function6FnOnce40call_once$u7b$$u7b$vtable.shim$u7d$$u7d$17hffc6a0d7fdc3da9dE" to i8*), i8* bitcast (i32 (i64**)* @"_ZN3std2rt10lang_start28_$u7b$$u7b$closure$u7d$$u7d$17h173c611b8918863cE" to i8*), i8* bitcast (i32 (i64**)* @"_ZN3std2rt10lang_start28_$u7b$$u7b$closure$u7d$$u7d$17h173c611b8918863cE" to i8*), [0 x i8] zeroinitializer }>, align 8, !dbg !0
@alloc54 = private unnamed_addr constant <{ [1 x i8] }> <{ [1 x i8] c"[" }>, align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "impl$<std::rt::lang_start::closure$0, core::ops::function::Fn<tuple$<> > >::vtable$", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 384, align: 64, elements: !6)
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ptr_const$<tuple$<> >", baseType: !5, size: 64, align: 64, dwarfAddressSpace: 0)
!5 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!6 = !{!7}
!7 = !DISubrange(count: 6, lowerBound: 0)
!8 = !{i32 7, !"PIC Level", i32 2}
!9 = !{i32 7, !"PIE Level", i32 2}
!10 = !{i32 2, !"CodeView", i32 1}
!11 = !{i32 2, !"Debug Info Version", i32 3}
!12 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !13, producer: "clang LLVM (rustc version 1.57.0 (f1edd0429 2021-11-29))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !14, globals: !93)
!13 = !DIFile(filename: "move.rs", directory: "C:\\Users\\froze\\Desktop\\cpg-thread-context")
!14 = !{!15, !23, !32, !39, !41, !81}
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Result", scope: !16, file: !2, baseType: !18, size: 8, align: 8, flags: DIFlagEnumClass, elements: !20)
!16 = !DINamespace(name: "result", scope: !17)
!17 = !DINamespace(name: "core", scope: null)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "u8", file: !2, baseType: !19)
!19 = !DIBasicType(name: "unsigned __int8", size: 8, encoding: DW_ATE_unsigned)
!20 = !{!21, !22}
!21 = !DIEnumerator(name: "Ok", value: 0)
!22 = !DIEnumerator(name: "Err", value: 1)
!23 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !24, file: !2, baseType: !18, size: 8, align: 8, flags: DIFlagEnumClass, elements: !27)
!24 = !DINamespace(name: "v1", scope: !25)
!25 = !DINamespace(name: "rt", scope: !26)
!26 = !DINamespace(name: "fmt", scope: !17)
!27 = !{!28, !29, !30, !31}
!28 = !DIEnumerator(name: "Left", value: 0)
!29 = !DIEnumerator(name: "Right", value: 1)
!30 = !DIEnumerator(name: "Center", value: 2)
!31 = !DIEnumerator(name: "Unknown", value: 3)
!32 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Option", scope: !33, file: !2, baseType: !34, size: 64, align: 64, flags: DIFlagEnumClass, elements: !36)
!33 = !DINamespace(name: "option", scope: !17)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "u64", file: !2, baseType: !35)
!35 = !DIBasicType(name: "unsigned __int64", size: 64, encoding: DW_ATE_unsigned)
!36 = !{!37, !38}
!37 = !DIEnumerator(name: "None", value: 0)
!38 = !DIEnumerator(name: "Some", value: 1)
!39 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Option", scope: !33, file: !2, baseType: !40, size: 64, align: 64, flags: DIFlagEnumClass, elements: !36)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ptr_mut$<tuple$<> >", baseType: !5, size: 64, align: 64, dwarfAddressSpace: 0)
!41 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Discriminant$", scope: !42, file: !2, baseType: !55, size: 64, align: 64, flags: DIFlagEnumClass, elements: !91)
!42 = !DICompositeType(tag: DW_TAG_union_type, name: "enum$<core::option::Option<slice$<core::fmt::rt::v1::Argument> >, 1, 18446744073709551615, Some>", file: !2, size: 128, align: 64, elements: !43, templateParams: !88, identifier: "9f12058bb667a24b38934f7caa658ba4")
!43 = !{!44, !90}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "dataful_variant", scope: !42, file: !2, baseType: !45, size: 128, align: 64)
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !42, file: !2, size: 128, align: 64, elements: !46, templateParams: !88, identifier: "9f12058bb667a24b38934f7caa658ba4::Some")
!46 = !{!47}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !45, file: !2, baseType: !48, size: 128, align: 64)
!48 = !DICompositeType(tag: DW_TAG_structure_type, name: "slice$<core::fmt::rt::v1::Argument>", file: !2, size: 128, align: 64, elements: !49, templateParams: !73, identifier: "51a3f8d51de3c140666a7f399cafd84")
!49 = !{!50, !87}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !48, file: !2, baseType: !51, size: 64, align: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ptr_const$<Argument>", baseType: !52, size: 64, align: 64, dwarfAddressSpace: 0)
!52 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !24, file: !2, size: 448, align: 64, elements: !53, templateParams: !73, identifier: "5cedcac9814cbf911535f483b20c17c7")
!53 = !{!54, !57}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !52, file: !2, baseType: !55, size: 64, align: 64)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "usize", file: !2, baseType: !56)
!56 = !DIBasicType(name: "size_t", size: 64, encoding: DW_ATE_unsigned)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !52, file: !2, baseType: !58, size: 384, align: 64, offset: 64)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormatSpec", scope: !24, file: !2, size: 384, align: 64, elements: !59, templateParams: !73, identifier: "2fa51ffafee008ca951439ebb20b70cf")
!59 = !{!60, !62, !63, !66, !86}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !58, file: !2, baseType: !61, size: 32, align: 32, offset: 256)
!61 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_unsigned_char)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !58, file: !2, baseType: !23, size: 8, align: 8, offset: 320)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !58, file: !2, baseType: !64, size: 32, align: 32, offset: 288)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "u32", file: !2, baseType: !65)
!65 = !DIBasicType(name: "unsigned __int32", size: 32, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !58, file: !2, baseType: !67, size: 128, align: 64)
!67 = !DICompositeType(tag: DW_TAG_union_type, name: "enum$<core::fmt::rt::v1::Count>", file: !2, size: 128, align: 64, elements: !68, templateParams: !73, identifier: "ccce56050c87953c6357a40ad22ff917")
!68 = !{!69, !74, !78, !80}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "variant0", scope: !67, file: !2, baseType: !70, size: 128, align: 64, extraData: i64 0)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !67, file: !2, size: 128, align: 64, elements: !71, templateParams: !73, identifier: "ccce56050c87953c6357a40ad22ff917::Is")
!71 = !{!72}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !70, file: !2, baseType: !55, size: 64, align: 64, offset: 64)
!73 = !{}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "variant1", scope: !67, file: !2, baseType: !75, size: 128, align: 64, extraData: i64 1)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !67, file: !2, size: 128, align: 64, elements: !76, templateParams: !73, identifier: "ccce56050c87953c6357a40ad22ff917::Param")
!76 = !{!77}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !75, file: !2, baseType: !55, size: 64, align: 64, offset: 64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "variant2", scope: !67, file: !2, baseType: !79, size: 128, align: 64, extraData: i64 2)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !67, file: !2, size: 128, align: 64, elements: !73, templateParams: !73, identifier: "ccce56050c87953c6357a40ad22ff917::Implied")
!80 = !DIDerivedType(tag: DW_TAG_member, name: "discriminant", scope: !67, file: !2, baseType: !81, size: 64, align: 64)
!81 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Count", scope: !24, file: !2, baseType: !34, size: 64, align: 64, flags: DIFlagEnumClass, elements: !82)
!82 = !{!83, !84, !85}
!83 = !DIEnumerator(name: "Is", value: 0)
!84 = !DIEnumerator(name: "Param", value: 1)
!85 = !DIEnumerator(name: "Implied", value: 2)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !58, file: !2, baseType: !67, size: 128, align: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !48, file: !2, baseType: !55, size: 64, align: 64, offset: 64)
!88 = !{!89}
!89 = !DITemplateTypeParameter(name: "T", type: !48)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "discriminant", scope: !42, file: !2, baseType: !41, size: 128, align: 64)
!91 = !{!92}
!92 = !DIEnumerator(name: "None", value: 0, isUnsigned: true)
!93 = !{!0}
!94 = distinct !DISubprogram(name: "__rust_begin_short_backtrace<void (*)(),tuple$<> >", linkageName: "_ZN3std10sys_common9backtrace28__rust_begin_short_backtrace17hb8579b901cda0721E", scope: !96, file: !95, line: 119, type: !99, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, templateParams: !108, retainedNodes: !104)
!95 = !DIFile(filename: "/rustc/f1edd0429582dd29cccacaf50fd134b05593bd9c\\library\\std\\src\\sys_common\\backtrace.rs", directory: "", checksumkind: CSK_SHA1, checksum: "7481dba50ead6f6229f49a1b24a1d4d6f773742a")
!96 = !DINamespace(name: "backtrace", scope: !97)
!97 = !DINamespace(name: "sys_common", scope: !98)
!98 = !DINamespace(name: "std", scope: null)
!99 = !DISubroutineType(types: !100)
!100 = !{null, !101}
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "void (*)()", baseType: !102, size: 64, align: 64, dwarfAddressSpace: 0)
!102 = !DISubroutineType(types: !103)
!103 = !{null}
!104 = !{!105, !106}
!105 = !DILocalVariable(name: "f", arg: 1, scope: !94, file: !95, line: 119, type: !101)
!106 = !DILocalVariable(name: "result", scope: !107, file: !95, line: 123, type: !5, align: 1)
!107 = distinct !DILexicalBlock(scope: !94, file: !95, line: 123)
!108 = !{!109, !110}
!109 = !DITemplateTypeParameter(name: "F", type: !101)
!110 = !DITemplateTypeParameter(name: "T", type: !5)
!111 = !DILocation(line: 123, scope: !107)
!112 = !DILocation(line: 119, scope: !94)
!113 = !DILocation(line: 123, scope: !94)
!114 = !DILocation(line: 126, scope: !107)
!115 = !DILocation(line: 129, scope: !94)
!116 = distinct !DISubprogram(name: "lang_start<tuple$<> >", linkageName: "_ZN3std2rt10lang_start17h67973226103bd5d3E", scope: !118, file: !117, line: 140, type: !119, scopeLine: 140, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, templateParams: !131, retainedNodes: !125)
!117 = !DIFile(filename: "/rustc/f1edd0429582dd29cccacaf50fd134b05593bd9c\\library\\std\\src\\rt.rs", directory: "", checksumkind: CSK_SHA1, checksum: "597960a6bbe3770d8b00da46c70b0aa1a1e7a6d7")
!118 = !DINamespace(name: "rt", scope: !98)
!119 = !DISubroutineType(types: !120)
!120 = !{!121, !101, !121, !123}
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "isize", file: !2, baseType: !122)
!122 = !DIBasicType(name: "ptrdiff_t", size: 64, encoding: DW_ATE_signed)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ptr_const$<ptr_const$<u8> >", baseType: !124, size: 64, align: 64, dwarfAddressSpace: 0)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ptr_const$<u8>", baseType: !18, size: 64, align: 64, dwarfAddressSpace: 0)
!125 = !{!126, !127, !128, !129}
!126 = !DILocalVariable(name: "main", arg: 1, scope: !116, file: !117, line: 141, type: !101)
!127 = !DILocalVariable(name: "argc", arg: 2, scope: !116, file: !117, line: 142, type: !121)
!128 = !DILocalVariable(name: "argv", arg: 3, scope: !116, file: !117, line: 143, type: !123)
!129 = !DILocalVariable(name: "v", scope: !130, file: !117, line: 145, type: !121, align: 8)
!130 = distinct !DILexicalBlock(scope: !116, file: !117, line: 145)
!131 = !{!110}
!132 = !DILocation(line: 141, scope: !116)
!133 = !DILocation(line: 142, scope: !116)
!134 = !DILocation(line: 143, scope: !116)
!135 = !DILocation(line: 146, scope: !116)
!136 = !DILocation(line: 145, scope: !116)
!137 = !DILocation(line: 145, scope: !130)
!138 = !DILocation(line: 151, scope: !116)
!139 = distinct !DISubprogram(name: "closure$0<tuple$<> >", linkageName: "_ZN3std2rt10lang_start28_$u7b$$u7b$closure$u7d$$u7d$17h173c611b8918863cE", scope: !140, file: !117, line: 146, type: !141, scopeLine: 146, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, templateParams: !131, retainedNodes: !149)
!140 = !DINamespace(name: "lang_start", scope: !118)
!141 = !DISubroutineType(types: !142)
!142 = !{!143, !145}
!143 = !DIDerivedType(tag: DW_TAG_typedef, name: "i32", file: !2, baseType: !144)
!144 = !DIBasicType(name: "__int32", size: 32, encoding: DW_ATE_signed)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ref$<closure$0>", baseType: !146, size: 64, align: 64, dwarfAddressSpace: 0)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "closure$0", scope: !140, file: !2, size: 64, align: 64, elements: !147, templateParams: !73, identifier: "8e4da3de4eea775afcf16c7d920eb9d")
!147 = !{!148}
!148 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !146, file: !2, baseType: !101, size: 64, align: 64)
!149 = !{!150}
!150 = !DILocalVariable(name: "main", scope: !139, file: !117, line: 141, type: !101, align: 8)
!151 = !DILocation(line: 141, scope: !139)
!152 = !DILocation(line: 146, scope: !139)
!153 = distinct !DISubprogram(name: "as_i32", linkageName: "_ZN3std3sys7windows7process8ExitCode6as_i3217h7d6595b6d30141daE", scope: !155, file: !154, line: 540, type: !161, scopeLine: 540, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, templateParams: !73, retainedNodes: !164)
!154 = !DIFile(filename: "/rustc/f1edd0429582dd29cccacaf50fd134b05593bd9c\\library\\std\\src\\sys\\windows\\process.rs", directory: "", checksumkind: CSK_SHA1, checksum: "f92da8c761b5c6d68870462ec738db5b47d28b46")
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !156, file: !2, size: 32, align: 32, elements: !159, templateParams: !73, identifier: "4883ccfa522087afb9ce066b3c14ebc5")
!156 = !DINamespace(name: "process", scope: !157)
!157 = !DINamespace(name: "windows", scope: !158)
!158 = !DINamespace(name: "sys", scope: !98)
!159 = !{!160}
!160 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !155, file: !2, baseType: !64, size: 32, align: 32)
!161 = !DISubroutineType(types: !162)
!162 = !{!143, !163}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ref$<ExitCode>", baseType: !155, size: 64, align: 64, dwarfAddressSpace: 0)
!164 = !{!165}
!165 = !DILocalVariable(name: "self", arg: 1, scope: !153, file: !154, line: 540, type: !163)
!166 = !DILocation(line: 540, scope: !153)
!167 = !DILocation(line: 541, scope: !153)
!168 = !DILocation(line: 542, scope: !153)
!169 = distinct !DISubprogram(name: "fmt<i32>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h092570ba90303c89E", scope: !171, file: !170, line: 2092, type: !172, scopeLine: 2092, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, templateParams: !208, retainedNodes: !205)
!170 = !DIFile(filename: "/rustc/f1edd0429582dd29cccacaf50fd134b05593bd9c\\library\\core\\src\\fmt\\mod.rs", directory: "", checksumkind: CSK_SHA1, checksum: "93df5c1039ca8308be61b01d67bd09e339bcd850")
!171 = !DINamespace(name: "impl$52", scope: !26)
!172 = !DISubroutineType(types: !173)
!173 = !{!15, !174, !176}
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ref$<ref$<i32> >", baseType: !175, size: 64, align: 64, dwarfAddressSpace: 0)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ref$<i32>", baseType: !143, size: 64, align: 64, dwarfAddressSpace: 0)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ref_mut$<Formatter>", baseType: !177, size: 64, align: 64, dwarfAddressSpace: 0)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !26, file: !2, size: 512, align: 64, elements: !178, templateParams: !73, identifier: "fb98afdf1edc202faa2bef7389a2e91c")
!178 = !{!179, !180, !181, !182, !194, !195}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !177, file: !2, baseType: !64, size: 32, align: 32, offset: 384)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !177, file: !2, baseType: !61, size: 32, align: 32, offset: 416)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !177, file: !2, baseType: !23, size: 8, align: 8, offset: 448)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !177, file: !2, baseType: !183, size: 128, align: 64)
!183 = !DICompositeType(tag: DW_TAG_union_type, name: "enum$<core::option::Option<usize> >", file: !2, size: 128, align: 64, elements: !184, templateParams: !187, identifier: "f19787a163da56c09a842fffdb11add7")
!184 = !{!185, !189, !193}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "variant0", scope: !183, file: !2, baseType: !186, size: 128, align: 64, extraData: i64 0)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !183, file: !2, size: 128, align: 64, elements: !73, templateParams: !187, identifier: "f19787a163da56c09a842fffdb11add7::None")
!187 = !{!188}
!188 = !DITemplateTypeParameter(name: "T", type: !55)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "variant1", scope: !183, file: !2, baseType: !190, size: 128, align: 64, extraData: i64 1)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !183, file: !2, size: 128, align: 64, elements: !191, templateParams: !187, identifier: "f19787a163da56c09a842fffdb11add7::Some")
!191 = !{!192}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !190, file: !2, baseType: !55, size: 64, align: 64, offset: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "discriminant", scope: !183, file: !2, baseType: !32, size: 64, align: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !177, file: !2, baseType: !183, size: 128, align: 64, offset: 128)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !177, file: !2, baseType: !196, size: 128, align: 64, offset: 256)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "ref_mut$<dyn$<core::fmt::Write> >", file: !2, size: 128, align: 64, elements: !197, templateParams: !73, identifier: "db21c4820ab588111e9b639306cc8f97")
!197 = !{!198, !200}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !196, file: !2, baseType: !199, size: 64, align: 64, flags: DIFlagArtificial)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ptr_mut$<u8>", baseType: !18, size: 64, align: 64, dwarfAddressSpace: 0)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !196, file: !2, baseType: !201, size: 64, align: 64, offset: 64, flags: DIFlagArtificial)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ref$<array$<usize,3> >", baseType: !202, size: 64, align: 64, dwarfAddressSpace: 0)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 192, align: 64, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 3, lowerBound: 0)
!205 = !{!206, !207}
!206 = !DILocalVariable(name: "self", arg: 1, scope: !169, file: !170, line: 2092, type: !174)
!207 = !DILocalVariable(name: "f", arg: 2, scope: !169, file: !170, line: 2092, type: !176)
!208 = !{!209}
!209 = !DITemplateTypeParameter(name: "T", type: !143)
!210 = !DILocation(line: 2092, scope: !169)
!211 = distinct !DISubprogram(name: "fmt<str>", linkageName: "_ZN44_$LT$$RF$T$u20$as$u20$core..fmt..Display$GT$3fmt17hb97c6d39aea15029E", scope: !212, file: !170, line: 2092, type: !213, scopeLine: 2092, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, templateParams: !223, retainedNodes: !220)
!212 = !DINamespace(name: "impl$54", scope: !26)
!213 = !DISubroutineType(types: !214)
!214 = !{!15, !215, !176}
!215 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ref$<str>", baseType: !216, size: 64, align: 64, dwarfAddressSpace: 0)
!216 = !DICompositeType(tag: DW_TAG_structure_type, name: "str", file: !2, size: 128, align: 64, elements: !217, templateParams: !73, identifier: "7ef2a91eecc7bcf4b4aaea2dbce79437")
!217 = !{!218, !219}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !216, file: !2, baseType: !124, size: 64, align: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !216, file: !2, baseType: !55, size: 64, align: 64, offset: 64)
!220 = !{!221, !222}
!221 = !DILocalVariable(name: "self", arg: 1, scope: !211, file: !170, line: 2092, type: !215)
!222 = !DILocalVariable(name: "f", arg: 2, scope: !211, file: !170, line: 2092, type: !176)
!223 = !{!224}
!224 = !DITemplateTypeParameter(name: "T", type: !225)
!225 = !DICompositeType(tag: DW_TAG_array_type, baseType: !226, align: 8, elements: !228)
!226 = !DIDerivedType(tag: DW_TAG_typedef, name: "i8", file: !2, baseType: !227)
!227 = !DIBasicType(name: "__int8", size: 8, encoding: DW_ATE_signed)
!228 = !{!229}
!229 = !DISubrange(count: -1, lowerBound: 0)
!230 = !DILocation(line: 2092, scope: !211)
!231 = distinct !DISubprogram(name: "new<str>", linkageName: "_ZN4core3fmt10ArgumentV13new17h1a24cc28f11807ebE", scope: !232, file: !170, line: 314, type: !241, scopeLine: 314, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, templateParams: !247, retainedNodes: !244)
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentV1", scope: !26, file: !2, size: 128, align: 64, elements: !233, templateParams: !73, identifier: "91360fa37a32cbf4b86ecc09678a3da8")
!233 = !{!234, !237}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !232, file: !2, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ref$<Opaque>", baseType: !236, size: 64, align: 64, dwarfAddressSpace: 0)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", file: !2, align: 8, elements: !73, identifier: "5dda6ffecdd070bdf504faeb28a11ae8")
!237 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !232, file: !2, baseType: !238, size: 64, align: 64, offset: 64)
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "enum$<core::result::Result<tuple$<>,core::fmt::Error> > (*)(ref$<core::fmt::::Opaque>,ref_mut$<core::fmt::Formatter>)", baseType: !239, size: 64, align: 64, dwarfAddressSpace: 0)
!239 = !DISubroutineType(types: !240)
!240 = !{!15, !235, !176}
!241 = !DISubroutineType(types: !242)
!242 = !{!232, !215, !243}
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "enum$<core::result::Result<tuple$<>,core::fmt::Error> > (*)(ref$<str>,ref_mut$<core::fmt::Formatter>)", baseType: !213, size: 64, align: 64, dwarfAddressSpace: 0)
!244 = !{!245, !246}
!245 = !DILocalVariable(name: "x", arg: 1, scope: !231, file: !170, line: 314, type: !215)
!246 = !DILocalVariable(name: "f", arg: 2, scope: !231, file: !170, line: 314, type: !243)
!247 = !{!248}
!248 = !DITemplateTypeParameter(name: "T", type: !216)
!249 = !DILocation(line: 314, scope: !231)
!250 = !DILocation(line: 323, scope: !231)
!251 = !DILocation(line: 324, scope: !231)
!252 = distinct !DISubprogram(name: "new<ref$<i32> >", linkageName: "_ZN4core3fmt10ArgumentV13new17ha4532b9da878601fE", scope: !232, file: !170, line: 314, type: !253, scopeLine: 314, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, templateParams: !259, retainedNodes: !256)
!253 = !DISubroutineType(types: !254)
!254 = !{!232, !174, !255}
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "enum$<core::result::Result<tuple$<>,core::fmt::Error> > (*)(ref$<ref$<i32> >,ref_mut$<core::fmt::Formatter>)", baseType: !172, size: 64, align: 64, dwarfAddressSpace: 0)
!256 = !{!257, !258}
!257 = !DILocalVariable(name: "x", arg: 1, scope: !252, file: !170, line: 314, type: !174)
!258 = !DILocalVariable(name: "f", arg: 2, scope: !252, file: !170, line: 314, type: !255)
!259 = !{!260}
!260 = !DITemplateTypeParameter(name: "T", type: !175)
!261 = !DILocation(line: 314, scope: !252)
!262 = !DILocation(line: 323, scope: !252)
!263 = !DILocation(line: 324, scope: !252)
!264 = distinct !DISubprogram(name: "new<u32>", linkageName: "_ZN4core3fmt10ArgumentV13new17hb3181ef749a34bc3E", scope: !232, file: !170, line: 314, type: !265, scopeLine: 314, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, templateParams: !274, retainedNodes: !271)
!265 = !DISubroutineType(types: !266)
!266 = !{!232, !267, !268}
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ref$<u32>", baseType: !64, size: 64, align: 64, dwarfAddressSpace: 0)
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "enum$<core::result::Result<tuple$<>,core::fmt::Error> > (*)(ref$<u32>,ref_mut$<core::fmt::Formatter>)", baseType: !269, size: 64, align: 64, dwarfAddressSpace: 0)
!269 = !DISubroutineType(types: !270)
!270 = !{!15, !267, !176}
!271 = !{!272, !273}
!272 = !DILocalVariable(name: "x", arg: 1, scope: !264, file: !170, line: 314, type: !267)
!273 = !DILocalVariable(name: "f", arg: 2, scope: !264, file: !170, line: 314, type: !268)
!274 = !{!275}
!275 = !DITemplateTypeParameter(name: "T", type: !64)
!276 = !DILocation(line: 314, scope: !264)
!277 = !DILocation(line: 323, scope: !264)
!278 = !DILocation(line: 324, scope: !264)
!279 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num50_$LT$impl$u20$core..fmt..Debug$u20$for$u20$i32$GT$3fmt17he82da00422b8e155E", scope: !281, file: !280, line: 185, type: !283, scopeLine: 185, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, templateParams: !73, retainedNodes: !285)
!280 = !DIFile(filename: "/rustc/f1edd0429582dd29cccacaf50fd134b05593bd9c\\library\\core\\src\\fmt\\num.rs", directory: "", checksumkind: CSK_SHA1, checksum: "dc43c0914ac0092af0ab175569929520a80e5ece")
!281 = !DINamespace(name: "impl$80", scope: !282)
!282 = !DINamespace(name: "num", scope: !26)
!283 = !DISubroutineType(types: !284)
!284 = !{!15, !175, !176}
!285 = !{!286, !287}
!286 = !DILocalVariable(name: "self", arg: 1, scope: !279, file: !280, line: 185, type: !175)
!287 = !DILocalVariable(name: "f", arg: 2, scope: !279, file: !280, line: 185, type: !176)
!288 = !DILocation(line: 185, scope: !279)
!289 = !DILocation(line: 186, scope: !279)
!290 = !DILocation(line: 188, scope: !279)
!291 = !DILocation(line: 187, scope: !279)
!292 = !DILocation(line: 193, scope: !279)
!293 = !{i8 0, i8 2}
!294 = !DILocation(line: 191, scope: !279)
!295 = !DILocation(line: 189, scope: !279)
!296 = distinct !DISubprogram(name: "new_v1_formatted", linkageName: "_ZN4core3fmt9Arguments16new_v1_formatted17h5d341c058059a59cE", scope: !297, file: !170, line: 382, type: !312, scopeLine: 382, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, templateParams: !73, retainedNodes: !317)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !26, file: !2, size: 384, align: 64, elements: !298, templateParams: !73, identifier: "7e38858026fda4b120e6e229c6a6a76e")
!298 = !{!299, !305, !306}
!299 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !297, file: !2, baseType: !300, size: 128, align: 64)
!300 = !DICompositeType(tag: DW_TAG_structure_type, name: "slice$<str>", file: !2, size: 128, align: 64, elements: !301, templateParams: !73, identifier: "e5181a2ba73cefd2b9372dc5646453a9")
!301 = !{!302, !304}
!302 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !300, file: !2, baseType: !303, size: 64, align: 64)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ptr_const$<str>", baseType: !216, size: 64, align: 64, dwarfAddressSpace: 0)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !300, file: !2, baseType: !55, size: 64, align: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !297, file: !2, baseType: !42, size: 128, align: 64, offset: 128)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !297, file: !2, baseType: !307, size: 128, align: 64, offset: 256)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "slice$<core::fmt::ArgumentV1>", file: !2, size: 128, align: 64, elements: !308, templateParams: !73, identifier: "4ae4d5fabc328466c2dfc592dc22530c")
!308 = !{!309, !311}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !307, file: !2, baseType: !310, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ptr_const$<ArgumentV1>", baseType: !232, size: 64, align: 64, dwarfAddressSpace: 0)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !307, file: !2, baseType: !55, size: 64, align: 64, offset: 64)
!312 = !DISubroutineType(types: !313)
!313 = !{!297, !300, !307, !48, !314}
!314 = !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeArg", scope: !26, file: !2, align: 8, elements: !315, templateParams: !73, identifier: "a57c72f252b7955c360b03c29ff116b1")
!315 = !{!316}
!316 = !DIDerivedType(tag: DW_TAG_member, name: "_private", scope: !314, file: !2, baseType: !5, align: 8)
!317 = !{!318, !319, !320, !321}
!318 = !DILocalVariable(name: "pieces", scope: !296, file: !170, line: 383, type: !300, align: 8)
!319 = !DILocalVariable(name: "args", scope: !296, file: !170, line: 384, type: !307, align: 8)
!320 = !DILocalVariable(name: "fmt", scope: !296, file: !170, line: 385, type: !48, align: 8)
!321 = !DILocalVariable(name: "_unsafe_arg", arg: 4, scope: !296, file: !170, line: 386, type: !314)
!322 = !DILocation(line: 383, scope: !296)
!323 = !DILocation(line: 384, scope: !296)
!324 = !DILocation(line: 385, scope: !296)
!325 = !DILocation(line: 386, scope: !296)
!326 = !DILocation(line: 388, scope: !296)
!327 = !DILocation(line: 389, scope: !296)
!328 = distinct !DISubprogram(name: "call_once<std::rt::lang_start::closure$0,tuple$<> >", linkageName: "_ZN4core3ops8function6FnOnce40call_once$u7b$$u7b$vtable.shim$u7d$$u7d$17hffc6a0d7fdc3da9dE", scope: !330, file: !329, line: 227, type: !333, scopeLine: 227, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, templateParams: !339, retainedNodes: !336)
!329 = !DIFile(filename: "/rustc/f1edd0429582dd29cccacaf50fd134b05593bd9c\\library\\core\\src\\ops\\function.rs", directory: "", checksumkind: CSK_SHA1, checksum: "9bea7362fff50bbe301170918847d3ca3912a24a")
!330 = !DINamespace(name: "FnOnce", scope: !331)
!331 = !DINamespace(name: "function", scope: !332)
!332 = !DINamespace(name: "ops", scope: !17)
!333 = !DISubroutineType(types: !334)
!334 = !{!143, !335}
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ptr_mut$<closure$0>", baseType: !146, size: 64, align: 64, dwarfAddressSpace: 0)
!336 = !{!337, !338}
!337 = !DILocalVariable(arg: 1, scope: !328, file: !329, line: 227, type: !335)
!338 = !DILocalVariable(arg: 2, scope: !328, file: !329, line: 227, type: !5)
!339 = !{!340, !341}
!340 = !DITemplateTypeParameter(name: "Self", type: !146)
!341 = !DITemplateTypeParameter(name: "Args", type: !5)
!342 = !DILocation(line: 227, scope: !328)
!343 = distinct !DISubprogram(name: "call_once<void (*)(),tuple$<> >", linkageName: "_ZN4core3ops8function6FnOnce9call_once17h166f449d967355b8E", scope: !330, file: !329, line: 227, type: !99, scopeLine: 227, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, templateParams: !347, retainedNodes: !344)
!344 = !{!345, !346}
!345 = !DILocalVariable(arg: 1, scope: !343, file: !329, line: 227, type: !101)
!346 = !DILocalVariable(arg: 2, scope: !343, file: !329, line: 227, type: !5)
!347 = !{!348, !341}
!348 = !DITemplateTypeParameter(name: "Self", type: !101)
!349 = !DILocation(line: 227, scope: !343)
!350 = distinct !DISubprogram(name: "call_once<std::rt::lang_start::closure$0,tuple$<> >", linkageName: "_ZN4core3ops8function6FnOnce9call_once17habe78f4b76e7c88fE", scope: !330, file: !329, line: 227, type: !351, scopeLine: 227, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, templateParams: !339, retainedNodes: !353)
!351 = !DISubroutineType(types: !352)
!352 = !{!143, !146}
!353 = !{!354, !355}
!354 = !DILocalVariable(arg: 1, scope: !350, file: !329, line: 227, type: !146)
!355 = !DILocalVariable(arg: 2, scope: !350, file: !329, line: 227, type: !5)
!356 = !DILocation(line: 227, scope: !350)
!357 = distinct !DISubprogram(name: "drop_in_place<std::rt::lang_start::closure$0>", linkageName: "_ZN4core3ptr85drop_in_place$LT$std..rt..lang_start$LT$$LP$$RP$$GT$..$u7b$$u7b$closure$u7d$$u7d$$GT$17h6006087de8b26dfbE", scope: !359, file: !358, line: 188, type: !360, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, templateParams: !364, retainedNodes: !362)
!358 = !DIFile(filename: "/rustc/f1edd0429582dd29cccacaf50fd134b05593bd9c\\library\\core\\src\\ptr\\mod.rs", directory: "", checksumkind: CSK_SHA1, checksum: "aeca184fb60233a3cea6a94a503d72921f522b88")
!359 = !DINamespace(name: "ptr", scope: !17)
!360 = !DISubroutineType(types: !361)
!361 = !{null, !335}
!362 = !{!363}
!363 = !DILocalVariable(arg: 1, scope: !357, file: !358, line: 188, type: !335)
!364 = !{!365}
!365 = !DITemplateTypeParameter(name: "T", type: !146)
!366 = !DILocation(line: 188, scope: !357)
!367 = distinct !DISubprogram(name: "black_box<tuple$<> >", linkageName: "_ZN4core4hint9black_box17h83bfb2ca0867b353E", scope: !369, file: !368, line: 157, type: !370, scopeLine: 157, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, templateParams: !131, retainedNodes: !372)
!368 = !DIFile(filename: "/rustc/f1edd0429582dd29cccacaf50fd134b05593bd9c\\library\\core\\src\\hint.rs", directory: "", checksumkind: CSK_SHA1, checksum: "c2de9c352dc54773256cf92ed93aaf0e24109a36")
!369 = !DINamespace(name: "hint", scope: !17)
!370 = !DISubroutineType(types: !371)
!371 = !{null, !5}
!372 = !{!373}
!373 = !DILocalVariable(name: "dummy", arg: 1, scope: !367, file: !368, line: 157, type: !5)
!374 = !DILocation(line: 157, scope: !367)
!375 = !DILocation(line: 158, scope: !367)
!376 = !{i32 3073002}
!377 = !DILocation(line: 159, scope: !367)
!378 = distinct !DISubprogram(name: "report", linkageName: "_ZN54_$LT$$LP$$RP$$u20$as$u20$std..process..Termination$GT$6report17hbdd78b6ded199ad1E", scope: !380, file: !379, line: 2019, type: !382, scopeLine: 2019, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, templateParams: !73, retainedNodes: !384)
!379 = !DIFile(filename: "/rustc/f1edd0429582dd29cccacaf50fd134b05593bd9c\\library\\std\\src\\process.rs", directory: "", checksumkind: CSK_SHA1, checksum: "c3a581a603d8dc15441744fa44bacaa2b460b507")
!380 = !DINamespace(name: "impl$48", scope: !381)
!381 = !DINamespace(name: "process", scope: !98)
!382 = !DISubroutineType(types: !383)
!383 = !{!143, !5}
!384 = !{!385}
!385 = !DILocalVariable(name: "self", arg: 1, scope: !378, file: !379, line: 2019, type: !5)
!386 = !DILocation(line: 2019, scope: !378)
!387 = !DILocation(line: 2020, scope: !378)
!388 = !DILocation(line: 2021, scope: !378)
!389 = distinct !DISubprogram(name: "report", linkageName: "_ZN68_$LT$std..process..ExitCode$u20$as$u20$std..process..Termination$GT$6report17h4e3e8d2cd83a4906E", scope: !390, file: !379, line: 2053, type: !391, scopeLine: 2053, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, templateParams: !73, retainedNodes: !396)
!390 = !DINamespace(name: "impl$52", scope: !381)
!391 = !DISubroutineType(types: !392)
!392 = !{!143, !393}
!393 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !381, file: !2, size: 32, align: 32, elements: !394, templateParams: !73, identifier: "ff75863b9316d7f817cde4933234eab7")
!394 = !{!395}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !393, file: !2, baseType: !155, size: 32, align: 32)
!396 = !{!397}
!397 = !DILocalVariable(name: "self", arg: 1, scope: !389, file: !379, line: 2053, type: !393)
!398 = !DILocation(line: 2053, scope: !389)
!399 = !DILocation(line: 2054, scope: !389)
!400 = !DILocation(line: 2055, scope: !389)
!401 = distinct !DISubprogram(name: "main", linkageName: "_ZN4move4main17h995e93c98e6a8e47E", scope: !403, file: !402, line: 1, type: !102, scopeLine: 1, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagMainSubprogram, unit: !12, templateParams: !73, retainedNodes: !404)
!402 = !DIFile(filename: "move.rs", directory: "C:\\Users\\froze\\Desktop\\cpg-thread-context", checksumkind: CSK_SHA1, checksum: "6c905a37c5ff0e9e369fdab47ef5d1b37c0895c5")
!403 = !DINamespace(name: "move", scope: null)
!404 = !{!405, !407, !409}
!405 = !DILocalVariable(name: "test", scope: !406, file: !402, line: 2, type: !143, align: 4)
!406 = distinct !DILexicalBlock(scope: !401, file: !402, line: 2)
!407 = !DILocalVariable(name: "other", scope: !408, file: !402, line: 3, type: !143, align: 4)
!408 = distinct !DILexicalBlock(scope: !406, file: !402, line: 3)
!409 = !DILocalVariable(name: "clsur", scope: !410, file: !402, line: 4, type: !411, align: 4)
!410 = distinct !DILexicalBlock(scope: !408, file: !402, line: 4)
!411 = !DICompositeType(tag: DW_TAG_structure_type, name: "closure$0", scope: !412, file: !2, size: 64, align: 32, elements: !413, templateParams: !73, identifier: "6602480fad4d6a4e4f8e01c2e4443a10")
!412 = !DINamespace(name: "main", scope: !403)
!413 = !{!414, !415}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "test", scope: !411, file: !2, baseType: !143, size: 32, align: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "other", scope: !411, file: !2, baseType: !143, size: 32, align: 32, offset: 32)
!416 = !DILocation(line: 4, scope: !410)
!417 = !DILocation(line: 2, scope: !401)
!418 = !DILocation(line: 2, scope: !406)
!419 = !DILocation(line: 3, scope: !406)
!420 = !DILocation(line: 3, scope: !408)
!421 = !DILocation(line: 4, scope: !408)
!422 = !DILocation(line: 5, scope: !410)
!423 = !DILocation(line: 6, scope: !401)
!424 = distinct !DISubprogram(name: "closure$0", linkageName: "_ZN4move4main28_$u7b$$u7b$closure$u7d$$u7d$17h2211813dcbec3012E", scope: !412, file: !402, line: 4, type: !425, scopeLine: 4, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, templateParams: !73, retainedNodes: !428)
!425 = !DISubroutineType(types: !426)
!426 = !{null, !427}
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "ref$<closure$0>", baseType: !411, size: 64, align: 64, dwarfAddressSpace: 0)
!428 = !{!429, !430, !431, !435, !438, !439, !440, !441, !444, !447, !448, !449}
!429 = !DILocalVariable(name: "test", scope: !424, file: !402, line: 2, type: !143, align: 4)
!430 = !DILocalVariable(name: "other", scope: !424, file: !402, line: 3, type: !143, align: 4)
!431 = !DILocalVariable(name: "tmp", scope: !432, file: !402, line: 4, type: !143, align: 4)
!432 = !DILexicalBlockFile(scope: !433, file: !402, discriminator: 0)
!433 = distinct !DILexicalBlock(scope: !424, file: !434, line: 298)
!434 = !DIFile(filename: "/rustc/f1edd0429582dd29cccacaf50fd134b05593bd9c\\library\\std\\src\\macros.rs", directory: "", checksumkind: CSK_SHA1, checksum: "e7690c661d48388bb8a33290e61e3bea10b6ff08")
!435 = !DILocalVariable(name: "arg0", scope: !436, file: !402, line: 4, type: !215, align: 8)
!436 = !DILexicalBlockFile(scope: !437, file: !402, discriminator: 0)
!437 = distinct !DILexicalBlock(scope: !433, file: !434, line: 156)
!438 = !DILocalVariable(name: "arg1", scope: !436, file: !402, line: 4, type: !267, align: 8)
!439 = !DILocalVariable(name: "arg2", scope: !436, file: !402, line: 4, type: !215, align: 8)
!440 = !DILocalVariable(name: "arg3", scope: !436, file: !402, line: 4, type: !174, align: 8)
!441 = !DILocalVariable(name: "tmp", scope: !442, file: !402, line: 4, type: !143, align: 4)
!442 = !DILexicalBlockFile(scope: !443, file: !402, discriminator: 0)
!443 = distinct !DILexicalBlock(scope: !424, file: !434, line: 298)
!444 = !DILocalVariable(name: "arg0", scope: !445, file: !402, line: 4, type: !215, align: 8)
!445 = !DILexicalBlockFile(scope: !446, file: !402, discriminator: 0)
!446 = distinct !DILexicalBlock(scope: !443, file: !434, line: 156)
!447 = !DILocalVariable(name: "arg1", scope: !445, file: !402, line: 4, type: !267, align: 8)
!448 = !DILocalVariable(name: "arg2", scope: !445, file: !402, line: 4, type: !215, align: 8)
!449 = !DILocalVariable(name: "arg3", scope: !445, file: !402, line: 4, type: !174, align: 8)
!450 = !DILocation(line: 2, scope: !424)
!451 = !DILocation(line: 3, scope: !424)
!452 = !DILocation(line: 4, scope: !432)
!453 = !DILocation(line: 4, scope: !442)
!454 = !DILocation(line: 4, scope: !424)
!455 = !DILocation(line: 4, scope: !436)
!456 = !DILocation(line: 4, scope: !445)
